{"backend": "tensorflow", "class_name": "Model", "config": {"input_layers": [["image_input", 0, 0], ["words_input", 0, 0]], "output_layers": [["target_word", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 256, 256, 3], "name": "image_input"}, "inbound_nodes": [], "name": "image_input"}, {"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["bn", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, 256, 256, 3], "dtype": "float32"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "padding": [[3, 3], [3, 3]], "data_format": "channels_last", "name": "zero_padding2d_1"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "zero_padding2d_1"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 64, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "valid", "kernel_size": [7, 7], "strides": [2, 2], "name": "conv1/conv"}, "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]], "name": "conv1/conv"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv1/bn"}, "inbound_nodes": [[["conv1/conv", 0, 0, {}]]], "name": "conv1/bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv1/relu"}, "inbound_nodes": [[["conv1/bn", 0, 0, {}]]], "name": "conv1/relu"}, {"class_name": "ZeroPadding2D", "config": {"trainable": true, "padding": [[1, 1], [1, 1]], "data_format": "channels_last", "name": "zero_padding2d_2"}, "inbound_nodes": [[["conv1/relu", 0, 0, {}]]], "name": "zero_padding2d_2"}, {"class_name": "MaxPooling2D", "config": {"pool_size": [3, 3], "data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2], "name": "pool1"}, "inbound_nodes": [[["zero_padding2d_2", 0, 0, {}]]], "name": "pool1"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv2_block1_0_bn"}, "inbound_nodes": [[["pool1", 0, 0, {}]]], "name": "conv2_block1_0_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv2_block1_0_relu"}, "inbound_nodes": [[["conv2_block1_0_bn", 0, 0, {}]]], "name": "conv2_block1_0_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 128, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "valid", "kernel_size": [1, 1], "strides": [1, 1], "name": "conv2_block1_1_conv"}, "inbound_nodes": [[["conv2_block1_0_relu", 0, 0, {}]]], "name": "conv2_block1_1_conv"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv2_block1_1_bn"}, "inbound_nodes": [[["conv2_block1_1_conv", 0, 0, {}]]], "name": "conv2_block1_1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv2_block1_1_relu"}, "inbound_nodes": [[["conv2_block1_1_bn", 0, 0, {}]]], "name": "conv2_block1_1_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 32, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2_block1_2_conv"}, "inbound_nodes": [[["conv2_block1_1_relu", 0, 0, {}]]], "name": "conv2_block1_2_conv"}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "conv2_block1_concat"}, "inbound_nodes": [[["pool1", 0, 0, {}], ["conv2_block1_2_conv", 0, 0, {}]]], "name": "conv2_block1_concat"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv2_block2_0_bn"}, "inbound_nodes": [[["conv2_block1_concat", 0, 0, {}]]], "name": "conv2_block2_0_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv2_block2_0_relu"}, "inbound_nodes": [[["conv2_block2_0_bn", 0, 0, {}]]], "name": "conv2_block2_0_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 128, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "valid", "kernel_size": [1, 1], "strides": [1, 1], "name": "conv2_block2_1_conv"}, "inbound_nodes": [[["conv2_block2_0_relu", 0, 0, {}]]], "name": "conv2_block2_1_conv"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv2_block2_1_bn"}, "inbound_nodes": [[["conv2_block2_1_conv", 0, 0, {}]]], "name": "conv2_block2_1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv2_block2_1_relu"}, "inbound_nodes": [[["conv2_block2_1_bn", 0, 0, {}]]], "name": "conv2_block2_1_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 32, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2_block2_2_conv"}, "inbound_nodes": [[["conv2_block2_1_relu", 0, 0, {}]]], "name": "conv2_block2_2_conv"}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "conv2_block2_concat"}, "inbound_nodes": [[["conv2_block1_concat", 0, 0, {}], ["conv2_block2_2_conv", 0, 0, {}]]], "name": "conv2_block2_concat"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv2_block3_0_bn"}, "inbound_nodes": [[["conv2_block2_concat", 0, 0, {}]]], "name": "conv2_block3_0_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv2_block3_0_relu"}, "inbound_nodes": [[["conv2_block3_0_bn", 0, 0, {}]]], "name": "conv2_block3_0_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 128, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "valid", "kernel_size": [1, 1], "strides": [1, 1], "name": "conv2_block3_1_conv"}, "inbound_nodes": [[["conv2_block3_0_relu", 0, 0, {}]]], "name": "conv2_block3_1_conv"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv2_block3_1_bn"}, "inbound_nodes": [[["conv2_block3_1_conv", 0, 0, {}]]], "name": "conv2_block3_1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv2_block3_1_relu"}, "inbound_nodes": [[["conv2_block3_1_bn", 0, 0, {}]]], "name": "conv2_block3_1_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 32, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2_block3_2_conv"}, "inbound_nodes": [[["conv2_block3_1_relu", 0, 0, {}]]], "name": "conv2_block3_2_conv"}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "conv2_block3_concat"}, "inbound_nodes": [[["conv2_block2_concat", 0, 0, {}], ["conv2_block3_2_conv", 0, 0, {}]]], "name": "conv2_block3_concat"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv2_block4_0_bn"}, "inbound_nodes": [[["conv2_block3_concat", 0, 0, {}]]], "name": "conv2_block4_0_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv2_block4_0_relu"}, "inbound_nodes": [[["conv2_block4_0_bn", 0, 0, {}]]], "name": "conv2_block4_0_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 128, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "valid", "kernel_size": [1, 1], "strides": [1, 1], "name": "conv2_block4_1_conv"}, "inbound_nodes": [[["conv2_block4_0_relu", 0, 0, {}]]], "name": "conv2_block4_1_conv"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv2_block4_1_bn"}, "inbound_nodes": [[["conv2_block4_1_conv", 0, 0, {}]]], "name": "conv2_block4_1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv2_block4_1_relu"}, "inbound_nodes": [[["conv2_block4_1_bn", 0, 0, {}]]], "name": "conv2_block4_1_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 32, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2_block4_2_conv"}, "inbound_nodes": [[["conv2_block4_1_relu", 0, 0, {}]]], "name": "conv2_block4_2_conv"}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "conv2_block4_concat"}, "inbound_nodes": [[["conv2_block3_concat", 0, 0, {}], ["conv2_block4_2_conv", 0, 0, {}]]], "name": "conv2_block4_concat"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv2_block5_0_bn"}, "inbound_nodes": [[["conv2_block4_concat", 0, 0, {}]]], "name": "conv2_block5_0_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv2_block5_0_relu"}, "inbound_nodes": [[["conv2_block5_0_bn", 0, 0, {}]]], "name": "conv2_block5_0_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 128, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "valid", "kernel_size": [1, 1], "strides": [1, 1], "name": "conv2_block5_1_conv"}, "inbound_nodes": [[["conv2_block5_0_relu", 0, 0, {}]]], "name": "conv2_block5_1_conv"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv2_block5_1_bn"}, "inbound_nodes": [[["conv2_block5_1_conv", 0, 0, {}]]], "name": "conv2_block5_1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv2_block5_1_relu"}, "inbound_nodes": [[["conv2_block5_1_bn", 0, 0, {}]]], "name": "conv2_block5_1_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 32, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2_block5_2_conv"}, "inbound_nodes": [[["conv2_block5_1_relu", 0, 0, {}]]], "name": "conv2_block5_2_conv"}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "conv2_block5_concat"}, "inbound_nodes": [[["conv2_block4_concat", 0, 0, {}], ["conv2_block5_2_conv", 0, 0, {}]]], "name": "conv2_block5_concat"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv2_block6_0_bn"}, "inbound_nodes": [[["conv2_block5_concat", 0, 0, {}]]], "name": "conv2_block6_0_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv2_block6_0_relu"}, "inbound_nodes": [[["conv2_block6_0_bn", 0, 0, {}]]], "name": "conv2_block6_0_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 128, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "valid", "kernel_size": [1, 1], "strides": [1, 1], "name": "conv2_block6_1_conv"}, "inbound_nodes": [[["conv2_block6_0_relu", 0, 0, {}]]], "name": "conv2_block6_1_conv"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv2_block6_1_bn"}, "inbound_nodes": [[["conv2_block6_1_conv", 0, 0, {}]]], "name": "conv2_block6_1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv2_block6_1_relu"}, "inbound_nodes": [[["conv2_block6_1_bn", 0, 0, {}]]], "name": "conv2_block6_1_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 32, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "strides": [1, 1], "name": "conv2_block6_2_conv"}, "inbound_nodes": [[["conv2_block6_1_relu", 0, 0, {}]]], "name": "conv2_block6_2_conv"}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "conv2_block6_concat"}, "inbound_nodes": [[["conv2_block5_concat", 0, 0, {}], ["conv2_block6_2_conv", 0, 0, {}]]], "name": "conv2_block6_concat"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "pool2_bn"}, "inbound_nodes": [[["conv2_block6_concat", 0, 0, {}]]], "name": "pool2_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "pool2_relu"}, "inbound_nodes": [[["pool2_bn", 0, 0, {}]]], "name": "pool2_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 128, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "valid", "kernel_size": [1, 1], "strides": [1, 1], "name": "pool2_conv"}, "inbound_nodes": [[["pool2_relu", 0, 0, {}]]], "name": "pool2_conv"}, {"class_name": "AveragePooling2D", "config": {"pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "padding": "valid", "strides": [2, 2], "name": "pool2_pool"}, "inbound_nodes": [[["pool2_conv", 0, 0, {}]]], "name": "pool2_pool"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv3_block1_0_bn"}, "inbound_nodes": [[["pool2_pool", 0, 0, {}]]], "name": "conv3_block1_0_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv3_block1_0_relu"}, "inbound_nodes": [[["conv3_block1_0_bn", 0, 0, {}]]], "name": "conv3_block1_0_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 128, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "valid", "kernel_size": [1, 1], "strides": [1, 1], "name": "conv3_block1_1_conv"}, "inbound_nodes": [[["conv3_block1_0_relu", 0, 0, {}]]], "name": "conv3_block1_1_conv"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv3_block1_1_bn"}, "inbound_nodes": [[["conv3_block1_1_conv", 0, 0, {}]]], "name": "conv3_block1_1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv3_block1_1_relu"}, "inbound_nodes": [[["conv3_block1_1_bn", 0, 0, {}]]], "name": "conv3_block1_1_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 32, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "strides": [1, 1], "name": "conv3_block1_2_conv"}, "inbound_nodes": [[["conv3_block1_1_relu", 0, 0, {}]]], "name": "conv3_block1_2_conv"}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "conv3_block1_concat"}, "inbound_nodes": [[["pool2_pool", 0, 0, {}], ["conv3_block1_2_conv", 0, 0, {}]]], "name": "conv3_block1_concat"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv3_block2_0_bn"}, "inbound_nodes": [[["conv3_block1_concat", 0, 0, {}]]], "name": "conv3_block2_0_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv3_block2_0_relu"}, "inbound_nodes": [[["conv3_block2_0_bn", 0, 0, {}]]], "name": "conv3_block2_0_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 128, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "valid", "kernel_size": [1, 1], "strides": [1, 1], "name": "conv3_block2_1_conv"}, "inbound_nodes": [[["conv3_block2_0_relu", 0, 0, {}]]], "name": "conv3_block2_1_conv"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv3_block2_1_bn"}, "inbound_nodes": [[["conv3_block2_1_conv", 0, 0, {}]]], "name": "conv3_block2_1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv3_block2_1_relu"}, "inbound_nodes": [[["conv3_block2_1_bn", 0, 0, {}]]], "name": "conv3_block2_1_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 32, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "strides": [1, 1], "name": "conv3_block2_2_conv"}, "inbound_nodes": [[["conv3_block2_1_relu", 0, 0, {}]]], "name": "conv3_block2_2_conv"}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "conv3_block2_concat"}, "inbound_nodes": [[["conv3_block1_concat", 0, 0, {}], ["conv3_block2_2_conv", 0, 0, {}]]], "name": "conv3_block2_concat"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv3_block3_0_bn"}, "inbound_nodes": [[["conv3_block2_concat", 0, 0, {}]]], "name": "conv3_block3_0_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv3_block3_0_relu"}, "inbound_nodes": [[["conv3_block3_0_bn", 0, 0, {}]]], "name": "conv3_block3_0_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 128, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "valid", "kernel_size": [1, 1], "strides": [1, 1], "name": "conv3_block3_1_conv"}, "inbound_nodes": [[["conv3_block3_0_relu", 0, 0, {}]]], "name": "conv3_block3_1_conv"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv3_block3_1_bn"}, "inbound_nodes": [[["conv3_block3_1_conv", 0, 0, {}]]], "name": "conv3_block3_1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv3_block3_1_relu"}, "inbound_nodes": [[["conv3_block3_1_bn", 0, 0, {}]]], "name": "conv3_block3_1_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 32, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "strides": [1, 1], "name": "conv3_block3_2_conv"}, "inbound_nodes": [[["conv3_block3_1_relu", 0, 0, {}]]], "name": "conv3_block3_2_conv"}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "conv3_block3_concat"}, "inbound_nodes": [[["conv3_block2_concat", 0, 0, {}], ["conv3_block3_2_conv", 0, 0, {}]]], "name": "conv3_block3_concat"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv3_block4_0_bn"}, "inbound_nodes": [[["conv3_block3_concat", 0, 0, {}]]], "name": "conv3_block4_0_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv3_block4_0_relu"}, "inbound_nodes": [[["conv3_block4_0_bn", 0, 0, {}]]], "name": "conv3_block4_0_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 128, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "valid", "kernel_size": [1, 1], "strides": [1, 1], "name": "conv3_block4_1_conv"}, "inbound_nodes": [[["conv3_block4_0_relu", 0, 0, {}]]], "name": "conv3_block4_1_conv"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv3_block4_1_bn"}, "inbound_nodes": [[["conv3_block4_1_conv", 0, 0, {}]]], "name": "conv3_block4_1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv3_block4_1_relu"}, "inbound_nodes": [[["conv3_block4_1_bn", 0, 0, {}]]], "name": "conv3_block4_1_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 32, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "strides": [1, 1], "name": "conv3_block4_2_conv"}, "inbound_nodes": [[["conv3_block4_1_relu", 0, 0, {}]]], "name": "conv3_block4_2_conv"}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "conv3_block4_concat"}, "inbound_nodes": [[["conv3_block3_concat", 0, 0, {}], ["conv3_block4_2_conv", 0, 0, {}]]], "name": "conv3_block4_concat"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv3_block5_0_bn"}, "inbound_nodes": [[["conv3_block4_concat", 0, 0, {}]]], "name": "conv3_block5_0_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv3_block5_0_relu"}, "inbound_nodes": [[["conv3_block5_0_bn", 0, 0, {}]]], "name": "conv3_block5_0_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 128, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "valid", "kernel_size": [1, 1], "strides": [1, 1], "name": "conv3_block5_1_conv"}, "inbound_nodes": [[["conv3_block5_0_relu", 0, 0, {}]]], "name": "conv3_block5_1_conv"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv3_block5_1_bn"}, "inbound_nodes": [[["conv3_block5_1_conv", 0, 0, {}]]], "name": "conv3_block5_1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv3_block5_1_relu"}, "inbound_nodes": [[["conv3_block5_1_bn", 0, 0, {}]]], "name": "conv3_block5_1_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 32, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "strides": [1, 1], "name": "conv3_block5_2_conv"}, "inbound_nodes": [[["conv3_block5_1_relu", 0, 0, {}]]], "name": "conv3_block5_2_conv"}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "conv3_block5_concat"}, "inbound_nodes": [[["conv3_block4_concat", 0, 0, {}], ["conv3_block5_2_conv", 0, 0, {}]]], "name": "conv3_block5_concat"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv3_block6_0_bn"}, "inbound_nodes": [[["conv3_block5_concat", 0, 0, {}]]], "name": "conv3_block6_0_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv3_block6_0_relu"}, "inbound_nodes": [[["conv3_block6_0_bn", 0, 0, {}]]], "name": "conv3_block6_0_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 128, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "valid", "kernel_size": [1, 1], "strides": [1, 1], "name": "conv3_block6_1_conv"}, "inbound_nodes": [[["conv3_block6_0_relu", 0, 0, {}]]], "name": "conv3_block6_1_conv"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv3_block6_1_bn"}, "inbound_nodes": [[["conv3_block6_1_conv", 0, 0, {}]]], "name": "conv3_block6_1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv3_block6_1_relu"}, "inbound_nodes": [[["conv3_block6_1_bn", 0, 0, {}]]], "name": "conv3_block6_1_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 32, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "strides": [1, 1], "name": "conv3_block6_2_conv"}, "inbound_nodes": [[["conv3_block6_1_relu", 0, 0, {}]]], "name": "conv3_block6_2_conv"}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "conv3_block6_concat"}, "inbound_nodes": [[["conv3_block5_concat", 0, 0, {}], ["conv3_block6_2_conv", 0, 0, {}]]], "name": "conv3_block6_concat"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv3_block7_0_bn"}, "inbound_nodes": [[["conv3_block6_concat", 0, 0, {}]]], "name": "conv3_block7_0_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv3_block7_0_relu"}, "inbound_nodes": [[["conv3_block7_0_bn", 0, 0, {}]]], "name": "conv3_block7_0_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 128, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "valid", "kernel_size": [1, 1], "strides": [1, 1], "name": "conv3_block7_1_conv"}, "inbound_nodes": [[["conv3_block7_0_relu", 0, 0, {}]]], "name": "conv3_block7_1_conv"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv3_block7_1_bn"}, "inbound_nodes": [[["conv3_block7_1_conv", 0, 0, {}]]], "name": "conv3_block7_1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv3_block7_1_relu"}, "inbound_nodes": [[["conv3_block7_1_bn", 0, 0, {}]]], "name": "conv3_block7_1_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 32, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "strides": [1, 1], "name": "conv3_block7_2_conv"}, "inbound_nodes": [[["conv3_block7_1_relu", 0, 0, {}]]], "name": "conv3_block7_2_conv"}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "conv3_block7_concat"}, "inbound_nodes": [[["conv3_block6_concat", 0, 0, {}], ["conv3_block7_2_conv", 0, 0, {}]]], "name": "conv3_block7_concat"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv3_block8_0_bn"}, "inbound_nodes": [[["conv3_block7_concat", 0, 0, {}]]], "name": "conv3_block8_0_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv3_block8_0_relu"}, "inbound_nodes": [[["conv3_block8_0_bn", 0, 0, {}]]], "name": "conv3_block8_0_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 128, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "valid", "kernel_size": [1, 1], "strides": [1, 1], "name": "conv3_block8_1_conv"}, "inbound_nodes": [[["conv3_block8_0_relu", 0, 0, {}]]], "name": "conv3_block8_1_conv"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "beta_constraint": null, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": 3, "beta_regularizer": null, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 1.001e-05, "trainable": true, "name": "conv3_block8_1_bn"}, "inbound_nodes": [[["conv3_block8_1_conv", 0, 0, {}]]], "name": "conv3_block8_1_bn"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv3_block8_1_relu"}, "inbound_nodes": [[["conv3_block8_1_bn", 0, 0, {}]]], "name": "conv3_block8_1_relu"}, {"class_name": "Conv2D", "config": {"activation": "linear", "filters": 32, "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "use_bias": false, "bias_constraint": null, "trainable": true, "padding": "same", "kernel_size": [3, 3], "strides": [1, 1], "name": "conv3_block8_2_conv"}, "inbound_nodes": [[["conv3_block8_1_relu", 0, 0, {}]]], "name": "conv3_block8_2_conv"}, {"class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "conv3_block8_concat"}, "inbound_nodes": [[["conv3_block7_concat", 0, 0, {}], ["conv3_block8_2_conv", 0, 0, {}]]], "name": "conv3_block8_concat"}, {"class_name": "BatchNormalization", "config": {"moving_mean_initializer": {"class_name": 