{"class_name": "Model", "backend": "tensorflow", "config": {"name": "model_5", "layers": [{"class_name": "InputLayer", "name": "image_input", "config": {"sparse": false, "name": "image_input", "batch_input_shape": [null, 256, 256, 3], "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Model", "name": "densenet121", "config": {"name": "densenet121", "layers": [{"class_name": "InputLayer", "name": "input_3", "config": {"sparse": false, "name": "input_3", "batch_input_shape": [null, 256, 256, 3], "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_5", "config": {"trainable": true, "name": "zero_padding2d_5", "padding": [[3, 3], [3, 3]], "data_format": "channels_last"}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv1/conv", "config": {"trainable": true, "padding": "valid", "filters": 64, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [2, 2], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv1/conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [7, 7]}, "inbound_nodes": [[["zero_padding2d_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv1/bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv1/bn", "beta_constraint": null}, "inbound_nodes": [[["conv1/conv", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv1/relu", "config": {"trainable": true, "name": "conv1/relu", "activation": "relu"}, "inbound_nodes": [[["conv1/bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "name": "zero_padding2d_6", "config": {"trainable": true, "name": "zero_padding2d_6", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "inbound_nodes": [[["conv1/relu", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "pool1", "config": {"trainable": true, "padding": "valid", "pool_size": [3, 3], "name": "pool1", "data_format": "channels_last", "strides": [2, 2]}, "inbound_nodes": [[["zero_padding2d_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv2_block1_0_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv2_block1_0_bn", "beta_constraint": null}, "inbound_nodes": [[["pool1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv2_block1_0_relu", "config": {"trainable": true, "name": "conv2_block1_0_relu", "activation": "relu"}, "inbound_nodes": [[["conv2_block1_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2_block1_1_conv", "config": {"trainable": true, "padding": "valid", "filters": 128, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2_block1_1_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [1, 1]}, "inbound_nodes": [[["conv2_block1_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv2_block1_1_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv2_block1_1_bn", "beta_constraint": null}, "inbound_nodes": [[["conv2_block1_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv2_block1_1_relu", "config": {"trainable": true, "name": "conv2_block1_1_relu", "activation": "relu"}, "inbound_nodes": [[["conv2_block1_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2_block1_2_conv", "config": {"trainable": true, "padding": "same", "filters": 32, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2_block1_2_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2_block1_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "conv2_block1_concat", "config": {"trainable": true, "name": "conv2_block1_concat", "axis": 3}, "inbound_nodes": [[["pool1", 0, 0, {}], ["conv2_block1_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv2_block2_0_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv2_block2_0_bn", "beta_constraint": null}, "inbound_nodes": [[["conv2_block1_concat", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv2_block2_0_relu", "config": {"trainable": true, "name": "conv2_block2_0_relu", "activation": "relu"}, "inbound_nodes": [[["conv2_block2_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2_block2_1_conv", "config": {"trainable": true, "padding": "valid", "filters": 128, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2_block2_1_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [1, 1]}, "inbound_nodes": [[["conv2_block2_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv2_block2_1_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv2_block2_1_bn", "beta_constraint": null}, "inbound_nodes": [[["conv2_block2_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv2_block2_1_relu", "config": {"trainable": true, "name": "conv2_block2_1_relu", "activation": "relu"}, "inbound_nodes": [[["conv2_block2_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2_block2_2_conv", "config": {"trainable": true, "padding": "same", "filters": 32, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2_block2_2_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2_block2_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "conv2_block2_concat", "config": {"trainable": true, "name": "conv2_block2_concat", "axis": 3}, "inbound_nodes": [[["conv2_block1_concat", 0, 0, {}], ["conv2_block2_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv2_block3_0_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv2_block3_0_bn", "beta_constraint": null}, "inbound_nodes": [[["conv2_block2_concat", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv2_block3_0_relu", "config": {"trainable": true, "name": "conv2_block3_0_relu", "activation": "relu"}, "inbound_nodes": [[["conv2_block3_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2_block3_1_conv", "config": {"trainable": true, "padding": "valid", "filters": 128, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2_block3_1_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [1, 1]}, "inbound_nodes": [[["conv2_block3_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv2_block3_1_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv2_block3_1_bn", "beta_constraint": null}, "inbound_nodes": [[["conv2_block3_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv2_block3_1_relu", "config": {"trainable": true, "name": "conv2_block3_1_relu", "activation": "relu"}, "inbound_nodes": [[["conv2_block3_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2_block3_2_conv", "config": {"trainable": true, "padding": "same", "filters": 32, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2_block3_2_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2_block3_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "conv2_block3_concat", "config": {"trainable": true, "name": "conv2_block3_concat", "axis": 3}, "inbound_nodes": [[["conv2_block2_concat", 0, 0, {}], ["conv2_block3_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv2_block4_0_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv2_block4_0_bn", "beta_constraint": null}, "inbound_nodes": [[["conv2_block3_concat", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv2_block4_0_relu", "config": {"trainable": true, "name": "conv2_block4_0_relu", "activation": "relu"}, "inbound_nodes": [[["conv2_block4_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2_block4_1_conv", "config": {"trainable": true, "padding": "valid", "filters": 128, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2_block4_1_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [1, 1]}, "inbound_nodes": [[["conv2_block4_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv2_block4_1_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv2_block4_1_bn", "beta_constraint": null}, "inbound_nodes": [[["conv2_block4_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv2_block4_1_relu", "config": {"trainable": true, "name": "conv2_block4_1_relu", "activation": "relu"}, "inbound_nodes": [[["conv2_block4_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2_block4_2_conv", "config": {"trainable": true, "padding": "same", "filters": 32, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2_block4_2_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2_block4_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "conv2_block4_concat", "config": {"trainable": true, "name": "conv2_block4_concat", "axis": 3}, "inbound_nodes": [[["conv2_block3_concat", 0, 0, {}], ["conv2_block4_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv2_block5_0_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv2_block5_0_bn", "beta_constraint": null}, "inbound_nodes": [[["conv2_block4_concat", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv2_block5_0_relu", "config": {"trainable": true, "name": "conv2_block5_0_relu", "activation": "relu"}, "inbound_nodes": [[["conv2_block5_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2_block5_1_conv", "config": {"trainable": true, "padding": "valid", "filters": 128, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2_block5_1_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [1, 1]}, "inbound_nodes": [[["conv2_block5_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv2_block5_1_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv2_block5_1_bn", "beta_constraint": null}, "inbound_nodes": [[["conv2_block5_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv2_block5_1_relu", "config": {"trainable": true, "name": "conv2_block5_1_relu", "activation": "relu"}, "inbound_nodes": [[["conv2_block5_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2_block5_2_conv", "config": {"trainable": true, "padding": "same", "filters": 32, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2_block5_2_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2_block5_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "conv2_block5_concat", "config": {"trainable": true, "name": "conv2_block5_concat", "axis": 3}, "inbound_nodes": [[["conv2_block4_concat", 0, 0, {}], ["conv2_block5_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv2_block6_0_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv2_block6_0_bn", "beta_constraint": null}, "inbound_nodes": [[["conv2_block5_concat", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv2_block6_0_relu", "config": {"trainable": true, "name": "conv2_block6_0_relu", "activation": "relu"}, "inbound_nodes": [[["conv2_block6_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2_block6_1_conv", "config": {"trainable": true, "padding": "valid", "filters": 128, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2_block6_1_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [1, 1]}, "inbound_nodes": [[["conv2_block6_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv2_block6_1_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv2_block6_1_bn", "beta_constraint": null}, "inbound_nodes": [[["conv2_block6_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv2_block6_1_relu", "config": {"trainable": true, "name": "conv2_block6_1_relu", "activation": "relu"}, "inbound_nodes": [[["conv2_block6_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2_block6_2_conv", "config": {"trainable": true, "padding": "same", "filters": 32, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv2_block6_2_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv2_block6_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "conv2_block6_concat", "config": {"trainable": true, "name": "conv2_block6_concat", "axis": 3}, "inbound_nodes": [[["conv2_block5_concat", 0, 0, {}], ["conv2_block6_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "pool2_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "pool2_bn", "beta_constraint": null}, "inbound_nodes": [[["conv2_block6_concat", 0, 0, {}]]]}, {"class_name": "Activation", "name": "pool2_relu", "config": {"trainable": true, "name": "pool2_relu", "activation": "relu"}, "inbound_nodes": [[["pool2_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "pool2_conv", "config": {"trainable": true, "padding": "valid", "filters": 128, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "pool2_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [1, 1]}, "inbound_nodes": [[["pool2_relu", 0, 0, {}]]]}, {"class_name": "AveragePooling2D", "name": "pool2_pool", "config": {"trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "pool2_pool", "data_format": "channels_last", "strides": [2, 2]}, "inbound_nodes": [[["pool2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv3_block1_0_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block1_0_bn", "beta_constraint": null}, "inbound_nodes": [[["pool2_pool", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv3_block1_0_relu", "config": {"trainable": true, "name": "conv3_block1_0_relu", "activation": "relu"}, "inbound_nodes": [[["conv3_block1_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv3_block1_1_conv", "config": {"trainable": true, "padding": "valid", "filters": 128, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv3_block1_1_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [1, 1]}, "inbound_nodes": [[["conv3_block1_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv3_block1_1_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block1_1_bn", "beta_constraint": null}, "inbound_nodes": [[["conv3_block1_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv3_block1_1_relu", "config": {"trainable": true, "name": "conv3_block1_1_relu", "activation": "relu"}, "inbound_nodes": [[["conv3_block1_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv3_block1_2_conv", "config": {"trainable": true, "padding": "same", "filters": 32, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv3_block1_2_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv3_block1_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "conv3_block1_concat", "config": {"trainable": true, "name": "conv3_block1_concat", "axis": 3}, "inbound_nodes": [[["pool2_pool", 0, 0, {}], ["conv3_block1_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv3_block2_0_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block2_0_bn", "beta_constraint": null}, "inbound_nodes": [[["conv3_block1_concat", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv3_block2_0_relu", "config": {"trainable": true, "name": "conv3_block2_0_relu", "activation": "relu"}, "inbound_nodes": [[["conv3_block2_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv3_block2_1_conv", "config": {"trainable": true, "padding": "valid", "filters": 128, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv3_block2_1_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [1, 1]}, "inbound_nodes": [[["conv3_block2_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv3_block2_1_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block2_1_bn", "beta_constraint": null}, "inbound_nodes": [[["conv3_block2_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv3_block2_1_relu", "config": {"trainable": true, "name": "conv3_block2_1_relu", "activation": "relu"}, "inbound_nodes": [[["conv3_block2_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv3_block2_2_conv", "config": {"trainable": true, "padding": "same", "filters": 32, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv3_block2_2_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv3_block2_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "conv3_block2_concat", "config": {"trainable": true, "name": "conv3_block2_concat", "axis": 3}, "inbound_nodes": [[["conv3_block1_concat", 0, 0, {}], ["conv3_block2_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv3_block3_0_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block3_0_bn", "beta_constraint": null}, "inbound_nodes": [[["conv3_block2_concat", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv3_block3_0_relu", "config": {"trainable": true, "name": "conv3_block3_0_relu", "activation": "relu"}, "inbound_nodes": [[["conv3_block3_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv3_block3_1_conv", "config": {"trainable": true, "padding": "valid", "filters": 128, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv3_block3_1_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [1, 1]}, "inbound_nodes": [[["conv3_block3_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv3_block3_1_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block3_1_bn", "beta_constraint": null}, "inbound_nodes": [[["conv3_block3_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv3_block3_1_relu", "config": {"trainable": true, "name": "conv3_block3_1_relu", "activation": "relu"}, "inbound_nodes": [[["conv3_block3_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv3_block3_2_conv", "config": {"trainable": true, "padding": "same", "filters": 32, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv3_block3_2_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv3_block3_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "conv3_block3_concat", "config": {"trainable": true, "name": "conv3_block3_concat", "axis": 3}, "inbound_nodes": [[["conv3_block2_concat", 0, 0, {}], ["conv3_block3_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv3_block4_0_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block4_0_bn", "beta_constraint": null}, "inbound_nodes": [[["conv3_block3_concat", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv3_block4_0_relu", "config": {"trainable": true, "name": "conv3_block4_0_relu", "activation": "relu"}, "inbound_nodes": [[["conv3_block4_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv3_block4_1_conv", "config": {"trainable": true, "padding": "valid", "filters": 128, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv3_block4_1_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [1, 1]}, "inbound_nodes": [[["conv3_block4_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv3_block4_1_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block4_1_bn", "beta_constraint": null}, "inbound_nodes": [[["conv3_block4_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv3_block4_1_relu", "config": {"trainable": true, "name": "conv3_block4_1_relu", "activation": "relu"}, "inbound_nodes": [[["conv3_block4_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv3_block4_2_conv", "config": {"trainable": true, "padding": "same", "filters": 32, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv3_block4_2_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv3_block4_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "conv3_block4_concat", "config": {"trainable": true, "name": "conv3_block4_concat", "axis": 3}, "inbound_nodes": [[["conv3_block3_concat", 0, 0, {}], ["conv3_block4_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv3_block5_0_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block5_0_bn", "beta_constraint": null}, "inbound_nodes": [[["conv3_block4_concat", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv3_block5_0_relu", "config": {"trainable": true, "name": "conv3_block5_0_relu", "activation": "relu"}, "inbound_nodes": [[["conv3_block5_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv3_block5_1_conv", "config": {"trainable": true, "padding": "valid", "filters": 128, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv3_block5_1_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [1, 1]}, "inbound_nodes": [[["conv3_block5_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv3_block5_1_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block5_1_bn", "beta_constraint": null}, "inbound_nodes": [[["conv3_block5_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv3_block5_1_relu", "config": {"trainable": true, "name": "conv3_block5_1_relu", "activation": "relu"}, "inbound_nodes": [[["conv3_block5_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv3_block5_2_conv", "config": {"trainable": true, "padding": "same", "filters": 32, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv3_block5_2_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv3_block5_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "conv3_block5_concat", "config": {"trainable": true, "name": "conv3_block5_concat", "axis": 3}, "inbound_nodes": [[["conv3_block4_concat", 0, 0, {}], ["conv3_block5_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv3_block6_0_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block6_0_bn", "beta_constraint": null}, "inbound_nodes": [[["conv3_block5_concat", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv3_block6_0_relu", "config": {"trainable": true, "name": "conv3_block6_0_relu", "activation": "relu"}, "inbound_nodes": [[["conv3_block6_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv3_block6_1_conv", "config": {"trainable": true, "padding": "valid", "filters": 128, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv3_block6_1_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [1, 1]}, "inbound_nodes": [[["conv3_block6_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv3_block6_1_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block6_1_bn", "beta_constraint": null}, "inbound_nodes": [[["conv3_block6_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv3_block6_1_relu", "config": {"trainable": true, "name": "conv3_block6_1_relu", "activation": "relu"}, "inbound_nodes": [[["conv3_block6_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv3_block6_2_conv", "config": {"trainable": true, "padding": "same", "filters": 32, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv3_block6_2_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv3_block6_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "conv3_block6_concat", "config": {"trainable": true, "name": "conv3_block6_concat", "axis": 3}, "inbound_nodes": [[["conv3_block5_concat", 0, 0, {}], ["conv3_block6_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv3_block7_0_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block7_0_bn", "beta_constraint": null}, "inbound_nodes": [[["conv3_block6_concat", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv3_block7_0_relu", "config": {"trainable": true, "name": "conv3_block7_0_relu", "activation": "relu"}, "inbound_nodes": [[["conv3_block7_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv3_block7_1_conv", "config": {"trainable": true, "padding": "valid", "filters": 128, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv3_block7_1_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [1, 1]}, "inbound_nodes": [[["conv3_block7_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv3_block7_1_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block7_1_bn", "beta_constraint": null}, "inbound_nodes": [[["conv3_block7_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv3_block7_1_relu", "config": {"trainable": true, "name": "conv3_block7_1_relu", "activation": "relu"}, "inbound_nodes": [[["conv3_block7_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv3_block7_2_conv", "config": {"trainable": true, "padding": "same", "filters": 32, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv3_block7_2_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv3_block7_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "conv3_block7_concat", "config": {"trainable": true, "name": "conv3_block7_concat", "axis": 3}, "inbound_nodes": [[["conv3_block6_concat", 0, 0, {}], ["conv3_block7_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv3_block8_0_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block8_0_bn", "beta_constraint": null}, "inbound_nodes": [[["conv3_block7_concat", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv3_block8_0_relu", "config": {"trainable": true, "name": "conv3_block8_0_relu", "activation": "relu"}, "inbound_nodes": [[["conv3_block8_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv3_block8_1_conv", "config": {"trainable": true, "padding": "valid", "filters": 128, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv3_block8_1_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [1, 1]}, "inbound_nodes": [[["conv3_block8_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv3_block8_1_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv3_block8_1_bn", "beta_constraint": null}, "inbound_nodes": [[["conv3_block8_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv3_block8_1_relu", "config": {"trainable": true, "name": "conv3_block8_1_relu", "activation": "relu"}, "inbound_nodes": [[["conv3_block8_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv3_block8_2_conv", "config": {"trainable": true, "padding": "same", "filters": 32, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv3_block8_2_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv3_block8_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "conv3_block8_concat", "config": {"trainable": true, "name": "conv3_block8_concat", "axis": 3}, "inbound_nodes": [[["conv3_block7_concat", 0, 0, {}], ["conv3_block8_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv3_block9_0_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, 