{"class_name": "Model", "backend": "tensorflow", "config": {"name": "model_24", "layers": [{"class_name": "InputLayer", "name": "image_input", "config": {"sparse": false, "name": "image_input", "batch_input_shape": [null, 256, 256, 3], "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Model", "name": "imgModel", "config": {"name": "imgModel", "layers": [{"class_name": "InputLayer", "name": "image_input", "config": {"sparse": false, "name": "image_input", "batch_input_shape": [null, 256, 256, 3], "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv", "config": {"trainable": true, "padding": "valid", "filters": 64, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv", "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["image_input", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv_1_0_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv_1_0_bn", "beta_constraint": null}, "inbound_nodes": [[["conv", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv_1_0_relu", "config": {"trainable": true, "name": "conv_1_0_relu", "activation": "relu"}, "inbound_nodes": [[["conv_1_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv_1_1_conv", "config": {"trainable": true, "padding": "valid", "filters": 256, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv_1_1_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [1, 1]}, "inbound_nodes": [[["conv_1_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "conv_1_1_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "conv_1_1_bn", "beta_constraint": null}, "inbound_nodes": [[["conv_1_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "name": "conv_1_1_relu", "config": {"trainable": true, "name": "conv_1_1_relu", "activation": "relu"}, "inbound_nodes": [[["conv_1_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv_1_2_conv", "config": {"trainable": true, "padding": "same", "filters": 64, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "conv_1_2_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["conv_1_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "conv_1_concat", "config": {"trainable": true, "name": "conv_1_concat", "axis": 3}, "inbound_nodes": [[["conv", 0, 0, {}], ["conv_1_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block_1_block1_0_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "block_1_block1_0_bn", "beta_constraint": null}, "inbound_nodes": [[["conv_1_concat", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block_1_block1_0_relu", "config": {"trainable": true, "name": "block_1_block1_0_relu", "activation": "relu"}, "inbound_nodes": [[["block_1_block1_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block_1_block1_1_conv", "config": {"trainable": true, "padding": "valid", "filters": 128, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block_1_block1_1_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_1_block1_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block_1_block1_1_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "block_1_block1_1_bn", "beta_constraint": null}, "inbound_nodes": [[["block_1_block1_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block_1_block1_1_relu", "config": {"trainable": true, "name": "block_1_block1_1_relu", "activation": "relu"}, "inbound_nodes": [[["block_1_block1_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block_1_block1_2_conv", "config": {"trainable": true, "padding": "same", "filters": 32, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block_1_block1_2_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["block_1_block1_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "block_1_block1_concat", "config": {"trainable": true, "name": "block_1_block1_concat", "axis": 3}, "inbound_nodes": [[["conv_1_concat", 0, 0, {}], ["block_1_block1_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_29", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_29", "beta_constraint": null}, "inbound_nodes": [[["block_1_block1_concat", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_19", "config": {"trainable": true, "name": "activation_19", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block1_reduction_conv", "config": {"trainable": true, "padding": "same", "filters": 64, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [2, 2], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block1_reduction_conv", "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [2, 2]}, "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_47", "config": {"trainable": true, "name": "dropout_47", "rate": 0.5, "seed": null, "noise_shape": null}, "inbound_nodes": [[["block1_reduction_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block_2_block1_0_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "block_2_block1_0_bn", "beta_constraint": null}, "inbound_nodes": [[["dropout_47", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block_2_block1_0_relu", "config": {"trainable": true, "name": "block_2_block1_0_relu", "activation": "relu"}, "inbound_nodes": [[["block_2_block1_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block_2_block1_1_conv", "config": {"trainable": true, "padding": "valid", "filters": 128, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block_2_block1_1_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_2_block1_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block_2_block1_1_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "block_2_block1_1_bn", "beta_constraint": null}, "inbound_nodes": [[["block_2_block1_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block_2_block1_1_relu", "config": {"trainable": true, "name": "block_2_block1_1_relu", "activation": "relu"}, "inbound_nodes": [[["block_2_block1_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block_2_block1_2_conv", "config": {"trainable": true, "padding": "same", "filters": 32, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block_2_block1_2_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["block_2_block1_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "block_2_block1_concat", "config": {"trainable": true, "name": "block_2_block1_concat", "axis": 3}, "inbound_nodes": [[["dropout_47", 0, 0, {}], ["block_2_block1_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_30", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_30", "beta_constraint": null}, "inbound_nodes": [[["block_2_block1_concat", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_20", "config": {"trainable": true, "name": "activation_20", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_reduction_conv", "config": {"trainable": true, "padding": "same", "filters": 128, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [2, 2], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block2_reduction_conv", "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [2, 2]}, "inbound_nodes": [[["activation_20", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_48", "config": {"trainable": true, "name": "dropout_48", "rate": 0.5, "seed": null, "noise_shape": null}, "inbound_nodes": [[["block2_reduction_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block_3_block1_0_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "block_3_block1_0_bn", "beta_constraint": null}, "inbound_nodes": [[["dropout_48", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block_3_block1_0_relu", "config": {"trainable": true, "name": "block_3_block1_0_relu", "activation": "relu"}, "inbound_nodes": [[["block_3_block1_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block_3_block1_1_conv", "config": {"trainable": true, "padding": "valid", "filters": 128, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block_3_block1_1_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_3_block1_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block_3_block1_1_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "block_3_block1_1_bn", "beta_constraint": null}, "inbound_nodes": [[["block_3_block1_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block_3_block1_1_relu", "config": {"trainable": true, "name": "block_3_block1_1_relu", "activation": "relu"}, "inbound_nodes": [[["block_3_block1_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block_3_block1_2_conv", "config": {"trainable": true, "padding": "same", "filters": 32, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block_3_block1_2_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["block_3_block1_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "block_3_block1_concat", "config": {"trainable": true, "name": "block_3_block1_concat", "axis": 3}, "inbound_nodes": [[["dropout_48", 0, 0, {}], ["block_3_block1_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_31", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_31", "beta_constraint": null}, "inbound_nodes": [[["block_3_block1_concat", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_21", "config": {"trainable": true, "name": "activation_21", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_31", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_reduction_conv", "config": {"trainable": true, "padding": "same", "filters": 256, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [2, 2], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block3_reduction_conv", "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [2, 2]}, "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_49", "config": {"trainable": true, "name": "dropout_49", "rate": 0.5, "seed": null, "noise_shape": null}, "inbound_nodes": [[["block3_reduction_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block_4_block1_0_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "block_4_block1_0_bn", "beta_constraint": null}, "inbound_nodes": [[["dropout_49", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block_4_block1_0_relu", "config": {"trainable": true, "name": "block_4_block1_0_relu", "activation": "relu"}, "inbound_nodes": [[["block_4_block1_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block_4_block1_1_conv", "config": {"trainable": true, "padding": "valid", "filters": 128, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block_4_block1_1_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_4_block1_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block_4_block1_1_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "block_4_block1_1_bn", "beta_constraint": null}, "inbound_nodes": [[["block_4_block1_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block_4_block1_1_relu", "config": {"trainable": true, "name": "block_4_block1_1_relu", "activation": "relu"}, "inbound_nodes": [[["block_4_block1_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block_4_block1_2_conv", "config": {"trainable": true, "padding": "same", "filters": 32, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block_4_block1_2_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["block_4_block1_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "block_4_block1_concat", "config": {"trainable": true, "name": "block_4_block1_concat", "axis": 3}, "inbound_nodes": [[["dropout_49", 0, 0, {}], ["block_4_block1_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_32", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_32", "beta_constraint": null}, "inbound_nodes": [[["block_4_block1_concat", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_22", "config": {"trainable": true, "name": "activation_22", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_32", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_reduction_conv", "config": {"trainable": true, "padding": "same", "filters": 512, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [2, 2], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block4_reduction_conv", "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [2, 2]}, "inbound_nodes": [[["activation_22", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_50", "config": {"trainable": true, "name": "dropout_50", "rate": 0.5, "seed": null, "noise_shape": null}, "inbound_nodes": [[["block4_reduction_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block_5_block1_0_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "block_5_block1_0_bn", "beta_constraint": null}, "inbound_nodes": [[["dropout_50", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block_5_block1_0_relu", "config": {"trainable": true, "name": "block_5_block1_0_relu", "activation": "relu"}, "inbound_nodes": [[["block_5_block1_0_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block_5_block1_1_conv", "config": {"trainable": true, "padding": "valid", "filters": 128, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block_5_block1_1_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [1, 1]}, "inbound_nodes": [[["block_5_block1_0_relu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "block_5_block1_1_bn", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 1.001e-05, "name": "block_5_block1_1_bn", "beta_constraint": null}, "inbound_nodes": [[["block_5_block1_1_conv", 0, 0, {}]]]}, {"class_name": "Activation", "name": "block_5_block1_1_relu", "config": {"trainable": true, "name": "block_5_block1_1_relu", "activation": "relu"}, "inbound_nodes": [[["block_5_block1_1_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block_5_block1_2_conv", "config": {"trainable": true, "padding": "same", "filters": 32, "use_bias": false, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block_5_block1_2_conv", "activation": "linear", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["block_5_block1_1_relu", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "block_5_block1_concat", "config": {"trainable": true, "name": "block_5_block1_concat", "axis": 3}, "inbound_nodes": [[["dropout_50", 0, 0, {}], ["block_5_block1_2_conv", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_33", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_33", "beta_constraint": null}, "inbound_nodes": [[["block_5_block1_concat", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_23", "config": {"trainable": true, "name": "activation_23", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_33", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_reduction_conv", "config": {"trainable": true, "padding": "same", "filters": 1024, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [2, 2], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block5_reduction_conv", "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [2, 2]}, "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_34", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_34", "beta_constraint": null}, "inbound_nodes": [[["block5_reduction_conv", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_24", "config": {"trainable": true, "name": "activation_24", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_34", 0, 0, {}]]]}], "output_layers": [["activation_24", 0, 0]], "input_layers": [["image_input", 0, 0]]}, "inbound_nodes": [[["image_input", 0, 0, {}]]]}, {"class_name": "InputLayer", "name": "words_input", "config": {"sparse": false, "name": "words_input", "batch_input_shape": [null, 193], "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Dropout", "name": "dropout_52", "config": {"trainable": true, "name": "dropout_52", "seed": null, "noise_shape": null, "rate": 0.1}, "inbound_nodes": [[["imgModel", 1, 0, {}]]]}, {"class_name": "Model", "name": "textModel", "config": {"name": "textModel", "layers": [{"class_name": "InputLayer", "name": "words_input", "config": {"sparse": false, "name": "words_input", "batch_input_shape": [null, 193], "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Embedding", "name": "w2v_emb", "config": {"trainable": true, "embeddings_regularizer": null, "dtype": "float32", "output_dim": 300, "activity_regularizer": null, "batch_input_shape": [null, null], "input_dim": 1943, "name": "w2v_emb", "mask_zero": false, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "embeddings_constraint": null, "input_length": null}, "inbound_nodes": [[["words_input", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_5", "config": {"trainable": true, "padding": "valid", "filters": 512, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "name": "conv1d_5", "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3]}, "inbound_nodes": [[["w2v_emb", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_51", "config": {"trainable": true, "name": "dropout_51", "rate": 0.1, "seed": null, "noise_shape": null}, "inbound_nodes": [[["conv1d_5", 0, 0, {}]]]}, {"class_name": "SelfAttention", "name": "self_attention_5", "config": {"trainable": true, "name": "self_attention_5"}, "inbound_nodes": [[["dropout_51", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling1D", "name": "sa_gap", "config": {"trainable": true, "name": "sa_gap"}, "inbound_nodes": [[["self_attention_5", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_14", "config": {"trainable": true, "units": 512, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "name": "dense_14", "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}, "inbound_nodes": [[["sa_gap", 0, 0, {}]]]}, {"class_name": "Attention", "name": "attention_5", "config": {"trainable": true, "name": "attention_5"}, "inbound_nodes": [[["dense_14", 0, 0, {}], ["self_attention_5", 0, 0, {}]]]}, {"class_name": "Lambda", "name": "a_gap", "config": {"trainable": true, "arguments": {}, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcxYAAAB0AABqAQBqAgB8AABkAQBkAgCDAQFTKQNO2gRheGlz\n6QEAAAApA9oBS9oCdGbaB3NxdWVlemUpAdoBeKkAcgcAAAD6IDxpcHl0aG9uLWlucHV0LTI5OS1i\nYTU1NzVjNThiMjI+2gg8bGFtYmRhPgsAAABzAAAAAA==\n", null, null], "name": "a_gap", "output_shape_type": "raw", "output_shape": null, "function_type": "lambda"}, "inbound_nodes": [[["attention_5", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_8", "config": {"trainable": true, "name": "concatenate_8", "axis": -1}, "inbound_nodes": [[["a_gap", 0, 0, {}], ["dense_14", 0, 0, {}]]]}], "output_layers": [["concatenate_8", 0, 0]], "input_layers": [["words_input", 0, 0]]}, "inbound_nodes": [[["words_input", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_4", "config": {"trainable": true, "name": "flatten_4", "data_format": "channels_last"}, "inbound_nodes": [[["dropout_52", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_53", "config": {"trainable": true, "name": "dropout_53", "seed": null, "noise_shape": null, "rate": 0.1}, "inbound_nodes": [[["textModel", 1, 0, {}]]]}, {"class_name": "Dense", "name": "dense_15", "config": {"trainable": true, "units": 512, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_15", "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}, "inbound_nodes": [[["flatten_4", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_16", "config": {"trainable": true, "units": 512, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_16", "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}, "inbound_nodes": [[["dropout_53", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_9", "config": {"trainable": true, "name": "concatenate_9", "axis": -1}, "inbound_nodes": [[["dense_15", 0, 0, {}], ["dense_16", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_17", "config": {"trainable": true, "units": 512, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_17", "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}, "inbound_nodes": [[["concatenate_9", 0, 0, {}]]]}, {"class_name": "Dense", "name": "target_word", "config": {"trainable": true, "units": 1943, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "target_word", "activation": "softmax", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}, "inbound_nodes": [[["dense_17", 0, 0, {}]]]}], "output_layers": [["target_word", 0, 0]], "input_layers": [["image_input", 0, 0], ["words_input", 0, 0]]}, "keras_version": "2.2.2"}