{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.2", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "image_input", "config": {"batch_input_shape": [null, 256, 256, 3], "name": "image_input", "dtype": "float32", "sparse": false}}, {"class_name": "InputLayer", "inbound_nodes": [], "name": "words_input", "config": {"batch_input_shape": [null, 60], "name": "words_input", "dtype": "float32", "sparse": false}}, {"class_name": "InputLayer", "inbound_nodes": [], "name": "padding_masks", "config": {"batch_input_shape": [null, 60, 1], "name": "padding_masks", "dtype": "float32", "sparse": false}}, {"class_name": "Model", "inbound_nodes": [[["image_input", 0, 0, {}]]], "name": "inception_resnet_v2", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"name": "input_1", "dtype": "float32", "batch_input_shape": [null, 256, 256, 3], "sparse": false}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "config": {"padding": "valid", "activation": "linear", "bias_regularizer": null, "name": "conv2d_1", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 32, "kernel_size": [3, 3], "bias_constraint": null, "strides": [2, 2], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1", "config": {"gamma_constraint": null, "name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "activation_1", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2", "config": {"padding": "valid", "activation": "linear", "bias_regularizer": null, "name": "conv2d_2", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 32, "kernel_size": [3, 3], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2", "config": {"gamma_constraint": null, "name": "batch_normalization_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "activation_2", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "conv2d_3", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_3", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 64, "kernel_size": [3, 3], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3", "config": {"gamma_constraint": null, "name": "batch_normalization_3", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "activation_3", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "max_pooling2d_1", "config": {"padding": "valid", "trainable": true, "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2], "pool_size": [3, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_4", "config": {"padding": "valid", "activation": "linear", "bias_regularizer": null, "name": "conv2d_4", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 80, "kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_4", "config": {"gamma_constraint": null, "name": "batch_normalization_4", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "activation_4", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "conv2d_5", "config": {"padding": "valid", "activation": "linear", "bias_regularizer": null, "name": "conv2d_5", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 192, "kernel_size": [3, 3], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_5", "config": {"gamma_constraint": null, "name": "batch_normalization_5", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "activation_5", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "max_pooling2d_2", "config": {"padding": "valid", "trainable": true, "name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2], "pool_size": [3, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_9", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_9", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 64, "kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "batch_normalization_9", "config": {"gamma_constraint": null, "name": "batch_normalization_9", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "name": "activation_9", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_7", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_7", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 48, "kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "conv2d_10", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_10", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 96, "kernel_size": [3, 3], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "batch_normalization_7", "config": {"gamma_constraint": null, "name": "batch_normalization_7", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "batch_normalization_10", "config": {"gamma_constraint": null, "name": "batch_normalization_10", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "activation_7", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "activation_10", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "average_pooling2d_1", "config": {"padding": "same", "trainable": true, "name": "average_pooling2d_1", "data_format": "channels_last", "strides": [1, 1], "pool_size": [3, 3]}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_6", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_6", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 96, "kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "conv2d_8", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_8", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 64, "kernel_size": [5, 5], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "conv2d_11", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_11", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 96, "kernel_size": [3, 3], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "name": "conv2d_12", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_12", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 64, "kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_6", "config": {"gamma_constraint": null, "name": "batch_normalization_6", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "batch_normalization_8", "config": {"gamma_constraint": null, "name": "batch_normalization_8", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "batch_normalization_11", "config": {"gamma_constraint": null, "name": "batch_normalization_11", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "batch_normalization_12", "config": {"gamma_constraint": null, "name": "batch_normalization_12", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "activation_6", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "activation_8", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "name": "activation_11", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "name": "activation_12", "config": {"activation": "relu", "trainable": true, "name": "activation_12"}}, {"class_name": "Concatenate", "inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]], "name": "mixed_5b", "config": {"trainable": true, "axis": 3, "name": "mixed_5b"}}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed_5b", 0, 0, {}]]], "name": "conv2d_16", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_16", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 32, "kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "batch_normalization_16", "config": {"gamma_constraint": null, "name": "batch_normalization_16", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "name": "activation_16", "config": {"activation": "relu", "trainable": true, "name": "activation_16"}}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed_5b", 0, 0, {}]]], "name": "conv2d_14", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_14", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 32, "kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "conv2d_17", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_17", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 48, "kernel_size": [3, 3], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "batch_normalization_14", "config": {"gamma_constraint": null, "name": "batch_normalization_14", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "batch_normalization_17", "config": {"gamma_constraint": null, "name": "batch_normalization_17", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "activation_14", "config": {"activation": "relu", "trainable": true, "name": "activation_14"}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "name": "activation_17", "config": {"activation": "relu", "trainable": true, "name": "activation_17"}}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed_5b", 0, 0, {}]]], "name": "conv2d_13", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_13", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 32, "kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "conv2d_15", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_15", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 32, "kernel_size": [3, 3], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "conv2d_18", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_18", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 64, "kernel_size": [3, 3], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "batch_normalization_13", "config": {"gamma_constraint": null, "name": "batch_normalization_13", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "batch_normalization_15", "config": {"gamma_constraint": null, "name": "batch_normalization_15", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "batch_normalization_18", "config": {"gamma_constraint": null, "name": "batch_normalization_18", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "name": "activation_13", "config": {"activation": "relu", "trainable": true, "name": "activation_13"}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "name": "activation_15", "config": {"activation": "relu", "trainable": true, "name": "activation_15"}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "name": "activation_18", "config": {"activation": "relu", "trainable": true, "name": "activation_18"}}, {"class_name": "Concatenate", "inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}]]], "name": "block35_1_mixed", "config": {"trainable": true, "axis": 3, "name": "block35_1_mixed"}}, {"class_name": "Conv2D", "inbound_nodes": [[["block35_1_mixed", 0, 0, {}]]], "name": "block35_1_conv", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "block35_1_conv", "data_format": "channels_last", "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 320, "kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Lambda", "inbound_nodes": [[["mixed_5b", 0, 0, {}], ["block35_1_conv", 0, 0, {}]]], "name": "block35_1", "config": {"trainable": true, "arguments": {"scale": 0.17}, "name": "block35_1", "output_shape_type": "raw", "function": ["4wIAAAAAAAAAAgAAAAMAAABTAAAAcxQAAAB8AABkAQAZfAAAZAIAGXwBABQXUykDTukAAAAA6QEA\nAACpACkC2gZpbnB1dHPaBXNjYWxlcgMAAAByAwAAAPpqL2hvbWUvbXNoYWlraDIvYW5hY29uZGEz\nL2VudnMvdGYtZ3B1L2xpYi9weXRob24zLjUvc2l0ZS1wYWNrYWdlcy9rZXJhc19hcHBsaWNhdGlv\nbnMvaW5jZXB0aW9uX3Jlc25ldF92Mi5wedoIPGxhbWJkYT6qAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "output_shape": [29, 29, 320]}}, {"class_name": "Activation", "inbound_nodes": [[["block35_1", 0, 0, {}]]], "name": "block35_1_ac", "config": {"activation": "relu", "trainable": true, "name": "block35_1_ac"}}, {"class_name": "Conv2D", "inbound_nodes": [[["block35_1_ac", 0, 0, {}]]], "name": "conv2d_22", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_22", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 32, "kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "name": "batch_normalization_22", "config": {"gamma_constraint": null, "name": "batch_normalization_22", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "name": "activation_22", "config": {"activation": "relu", "trainable": true, "name": "activation_22"}}, {"class_name": "Conv2D", "inbound_nodes": [[["block35_1_ac", 0, 0, {}]]], "name": "conv2d_20", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_20", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 32, "kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "name": "conv2d_23", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_23", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 48, "kernel_size": [3, 3], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "batch_normalization_20", "config": {"gamma_constraint": null, "name": "batch_normalization_20", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "batch_normalization_23", "config": {"gamma_constraint": null, "name": "batch_normalization_23", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "name": "activation_20", "config": {"activation": "relu", "trainable": true, "name": "activation_20"}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "name": "activation_23", "config": {"activation": "relu", "trainable": true, "name": "activation_23"}}, {"class_name": "Conv2D", "inbound_nodes": [[["block35_1_ac", 0, 0, {}]]], "name": "conv2d_19", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_19", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 32, "kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_20", 0, 0, {}]]], "name": "conv2d_21", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_21", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 32, "kernel_size": [3, 3], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "name": "conv2d_24", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_24", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 64, "kernel_size": [3, 3], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "batch_normalization_19", "config": {"gamma_constraint": null, "name": "batch_normalization_19", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "batch_normalization_21", "config": {"gamma_constraint": null, "name": "batch_normalization_21", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "name": "batch_normalization_24", "config": {"gamma_constraint": null, "name": "batch_normalization_24", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "name": "activation_19", "config": {"activation": "relu", "trainable": true, "name": "activation_19"}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "name": "activation_21", "config": {"activation": "relu", "trainable": true, "name": "activation_21"}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "name": "activation_24", "config": {"activation": "relu", "trainable": true, "name": "activation_24"}}, {"class_name": "Concatenate", "inbound_nodes": [[["activation_19", 0, 0, {}], ["activation_21", 0, 0, {}], ["activation_24", 0, 0, {}]]], "name": "block35_2_mixed", "config": {"trainable": true, "axis": 3, "name": "block35_2_mixed"}}, {"class_name": "Conv2D", "inbound_nodes": [[["block35_2_mixed", 0, 0, {}]]], "name": "block35_2_conv", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "block35_2_conv", "data_format": "channels_last", "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 320, "kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Lambda", "inbound_nodes": [[["block35_1_ac", 0, 0, {}], ["block35_2_conv", 0, 0, {}]]], "name": "block35_2", "config": {"trainable": true, "arguments": {"scale": 0.17}, "name": "block35_2", "output_shape_type": "raw", "function": ["4wIAAAAAAAAAAgAAAAMAAABTAAAAcxQAAAB8AABkAQAZfAAAZAIAGXwBABQXUykDTukAAAAA6QEA\nAACpACkC2gZpbnB1dHPaBXNjYWxlcgMAAAByAwAAAPpqL2hvbWUvbXNoYWlraDIvYW5hY29uZGEz\nL2VudnMvdGYtZ3B1L2xpYi9weXRob24zLjUvc2l0ZS1wYWNrYWdlcy9rZXJhc19hcHBsaWNhdGlv\nbnMvaW5jZXB0aW9uX3Jlc25ldF92Mi5wedoIPGxhbWJkYT6qAAAA8wAAAAA=\n", null, null], "function_type": "lambda", "output_shape": [29, 29, 320]}}, {"class_name": "Activation", "inbound_nodes": [[["block35_2", 0, 0, {}]]], "name": "block35_2_ac", "config": {"activation": "relu", "trainable": true, "name": "block35_2_ac"}}, {"class_name": "Conv2D", "inbound_nodes": [[["block35_2_ac", 0, 0, {}]]], "name": "conv2d_28", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_28", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 32, "kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "name": "batch_normalization_28", "config": {"gamma_constraint": null, "name": "batch_normalization_28", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "name": "activation_28", "config": {"activation": "relu", "trainable": true, "name": "activation_28"}}, {"class_name": "Conv2D", "inbound_nodes": [[["block35_2_ac", 0, 0, {}]]], "name": "conv2d_26", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_26", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 32, "kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "name": "conv2d_29", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_29", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 48, "kernel_size": [3, 3], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "name": "batch_normalization_26", "config": {"gamma_constraint": null, "name": "batch_normalization_26", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "name": "batch_normalization_29", "config": {"gamma_constraint": null, "name": "batch_normalization_29", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "name": "activation_26", "config": {"activation": "relu", "trainable": true, "name": "activation_26"}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "name": "activation_29", "config": {"activation": "relu", "trainable": true, "name": "activation_29"}}, {"class_name": "Conv2D", "inbound_nodes": [[["block35_2_ac", 0, 0, {}]]], "name": "conv2d_25", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_25", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 32, "kernel_size": [1, 1], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_26", 0, 0, {}]]], "name": "conv2d_27", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_27", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 32, "kernel_size": [3, 3], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "name": "conv2d_30", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "conv2d_30", "data_format": "channels_last", "use_bias": false, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "filters": 64, "kernel_size": [3, 3], "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "name": "batch_normalization_25", "config": {"gamma_constraint": null, "name": "batch_normalization_25", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "name": "batch_normalization_27", "config": {"gamma_constraint": null, "name": "batch_normalization_27", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "name": "batch_normalization_30", "config": {"gamma_constraint": null, "name": "batch_normalization_30", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": 3, "center": true, "epsilon": 0.001, "beta_constraint": null, "beta_regularizer": null, "scale": false, "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "name": "activation_25", "config": {"activation": "relu", "trainable": true, "name": "activation_25"}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "name": "activation_27", "config": {"activation": "relu", "trainable": true, "name": "activation_27"}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "name": "activation_30", "config": {"activation": "relu", "trainable": true, "name": "activation_30"}}, {"class_name": "Concatenate", "inbound_nodes": [[["activation_25", 0, 0, {}], ["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}]]], "name": "block35_3_mixed", "config": {"trainable": true, "axis": 3, "name": "block35_3_mixed"}}, {"class_name": "Conv2D", "inbound_nodes": [[["block35_3_mixed", 0, 0, {}]]], "name": "block35_3_conv", "config": {"padding": "same", "activation": "linear", "bias_regularizer": null, "name": "block35_3_conv", "data_format": 