{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.2", "config": {"output_layers": [["target_word", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "name": "image_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "name": "image_input"}}, {"inbound_nodes": [[["image_input", 0, 0, {}]]], "name": "inception_resnet_v2", "class_name": "Model", "config": {"output_layers": [["conv_7b_ac", 0, 0]], "name": "inception_resnet_v2", "layers": [{"inbound_nodes": [], "name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "name": "input_1"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv2d_1", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_1", "padding": "valid", "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [2, 2], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_1", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "activation_1", "class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "conv2d_2", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_2", "padding": "valid", "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_2", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "activation_2", "class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "conv2d_3", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_3", "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_3", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "activation_3", "class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_1", "padding": "valid", "data_format": "channels_last", "pool_size": [3, 3], "strides": [2, 2]}}, {"inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "conv2d_4", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_4", "padding": "valid", "data_format": "channels_last", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 80, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_4", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "activation_4", "class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "conv2d_5", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_5", "padding": "valid", "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 192, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_5", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "activation_5", "class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_2", "padding": "valid", "data_format": "channels_last", "pool_size": [3, 3], "strides": [2, 2]}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_9", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_9", "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["conv2d_9", 0, 0, {}]]], "name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_9", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "name": "activation_9", "class_name": "Activation", "config": {"trainable": true, "name": "activation_9", "activation": "relu"}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_7", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_7", "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 48, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "conv2d_10", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_10", "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 96, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_7", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["conv2d_10", 0, 0, {}]]], "name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_10", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "activation_7", "class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "activation_10", "class_name": "Activation", "config": {"trainable": true, "name": "activation_10", "activation": "relu"}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "average_pooling2d_1", "class_name": "AveragePooling2D", "config": {"trainable": true, "name": "average_pooling2d_1", "padding": "same", "data_format": "channels_last", "pool_size": [3, 3], "strides": [1, 1]}}, {"inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_6", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_6", "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 96, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "conv2d_8", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_8", "padding": "same", "data_format": "channels_last", "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "conv2d_11", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_11", "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 96, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "name": "conv2d_12", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_12", "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_6", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["conv2d_8", 0, 0, {}]]], "name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_8", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["conv2d_11", 0, 0, {}]]], "name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_11", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["conv2d_12", 0, 0, {}]]], "name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_12", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "activation_6", "class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "activation_8", "class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "relu"}}, {"inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "name": "activation_11", "class_name": "Activation", "config": {"trainable": true, "name": "activation_11", "activation": "relu"}}, {"inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "name": "activation_12", "class_name": "Activation", "config": {"trainable": true, "name": "activation_12", "activation": "relu"}}, {"inbound_nodes": [[["activation_6", 0, 0, {}], ["activation_8", 0, 0, {}], ["activation_11", 0, 0, {}], ["activation_12", 0, 0, {}]]], "name": "mixed_5b", "class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "mixed_5b"}}, {"inbound_nodes": [[["mixed_5b", 0, 0, {}]]], "name": "conv2d_16", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_16", "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["conv2d_16", 0, 0, {}]]], "name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_16", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["batch_normalization_16", 0, 0, {}]]], "name": "activation_16", "class_name": "Activation", "config": {"trainable": true, "name": "activation_16", "activation": "relu"}}, {"inbound_nodes": [[["mixed_5b", 0, 0, {}]]], "name": "conv2d_14", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_14", "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["activation_16", 0, 0, {}]]], "name": "conv2d_17", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_17", "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 48, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["conv2d_14", 0, 0, {}]]], "name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_14", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["conv2d_17", 0, 0, {}]]], "name": "batch_normalization_17", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_17", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "activation_14", "class_name": "Activation", "config": {"trainable": true, "name": "activation_14", "activation": "relu"}}, {"inbound_nodes": [[["batch_normalization_17", 0, 0, {}]]], "name": "activation_17", "class_name": "Activation", "config": {"trainable": true, "name": "activation_17", "activation": "relu"}}, {"inbound_nodes": [[["mixed_5b", 0, 0, {}]]], "name": "conv2d_13", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_13", "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "conv2d_15", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_15", "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["activation_17", 0, 0, {}]]], "name": "conv2d_18", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_18", "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["conv2d_13", 0, 0, {}]]], "name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_13", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["conv2d_15", 0, 0, {}]]], "name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_15", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["conv2d_18", 0, 0, {}]]], "name": "batch_normalization_18", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_18", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "name": "activation_13", "class_name": "Activation", "config": {"trainable": true, "name": "activation_13", "activation": "relu"}}, {"inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]], "name": "activation_15", "class_name": "Activation", "config": {"trainable": true, "name": "activation_15", "activation": "relu"}}, {"inbound_nodes": [[["batch_normalization_18", 0, 0, {}]]], "name": "activation_18", "class_name": "Activation", "config": {"trainable": true, "name": "activation_18", "activation": "relu"}}, {"inbound_nodes": [[["activation_13", 0, 0, {}], ["activation_15", 0, 0, {}], ["activation_18", 0, 0, {}]]], "name": "block35_1_mixed", "class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "block35_1_mixed"}}, {"inbound_nodes": [[["block35_1_mixed", 0, 0, {}]]], "name": "block35_1_conv", "class_name": "Conv2D", "config": {"trainable": true, "name": "block35_1_conv", "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 320, "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["mixed_5b", 0, 0, {}], ["block35_1_conv", 0, 0, {}]]], "name": "block35_1", "class_name": "Lambda", "config": {"trainable": true, "output_shape_type": "raw", "name": "block35_1", "output_shape": [29, 29, 320], "function_type": "lambda", "function": ["4wIAAAAAAAAAAgAAAAMAAABTAAAAcxQAAAB8AABkAQAZfAAAZAIAGXwBABQXUykDTukAAAAA6QEA\nAACpACkC2gZpbnB1dHPaBXNjYWxlcgMAAAByAwAAAPpqL2hvbWUvbXNoYWlraDIvYW5hY29uZGEz\nL2VudnMvdGYtZ3B1L2xpYi9weXRob24zLjUvc2l0ZS1wYWNrYWdlcy9rZXJhc19hcHBsaWNhdGlv\nbnMvaW5jZXB0aW9uX3Jlc25ldF92Mi5wedoIPGxhbWJkYT6qAAAA8wAAAAA=\n", null, null], "arguments": {"scale": 0.17}}}, {"inbound_nodes": [[["block35_1", 0, 0, {}]]], "name": "block35_1_ac", "class_name": "Activation", "config": {"trainable": true, "name": "block35_1_ac", "activation": "relu"}}, {"inbound_nodes": [[["block35_1_ac", 0, 0, {}]]], "name": "conv2d_22", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_22", "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["conv2d_22", 0, 0, {}]]], "name": "batch_normalization_22", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_22", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["batch_normalization_22", 0, 0, {}]]], "name": "activation_22", "class_name": "Activation", "config": {"trainable": true, "name": "activation_22", "activation": "relu"}}, {"inbound_nodes": [[["block35_1_ac", 0, 0, {}]]], "name": "conv2d_20", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_20", "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["activation_22", 0, 0, {}]]], "name": "conv2d_23", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_23", "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 48, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["conv2d_20", 0, 0, {}]]], "name": "batch_normalization_20", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_20", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["conv2d_23", 0, 0, {}]]], "name": "batch_normalization_23", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_23", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["batch_normalization_20", 0, 0, {}]]], "name": "activation_20", "class_name": "Activation", "config": {"trainable": true, "name": "activation_20", "activation": "relu"}}, {"inbound_nodes": [[["batch_normalization_23", 0, 0, {}]]], "name": "activation_23", "class_name": "Activation", "config": {"trainable": true, "name": "activation_23", "activation": "relu"}}, {"inbound_nodes": [[["block35_1_ac", 0, 0, {}]]], "name": "conv2d_19", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_19", "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["activation_20", 0, 0, {}]]], "name": "conv2d_21", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_21", "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["activation_23", 0, 0, {}]]], "name": "conv2d_24", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_24", "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["conv2d_19", 0, 0, {}]]], "name": "batch_normalization_19", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_19", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["conv2d_21", 0, 0, {}]]], "name": "batch_normalization_21", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_21", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["conv2d_24", 0, 0, {}]]], "name": "batch_normalization_24", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_24", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]], "name": "activation_19", "class_name": "Activation", "config": {"trainable": true, "name": "activation_19", "activation": "relu"}}, {"inbound_nodes": [[["batch_normalization_21", 0, 0, {}]]], "name": "activation_21", "class_name": "Activation", "config": {"trainable": true, "name": "activation_21", "activation": "relu"}}, {"inbound_nodes": [[["batch_normalization_24", 0, 0, {}]]], "name": "activation_24", "class_name": "Activation", "config": {"trainable": true, "name": "activation_24", "activation": "relu"}}, {"inbound_nodes": [[["activation_19", 0, 0, {}], ["activation_21", 0, 0, {}], ["activation_24", 0, 0, {}]]], "name": "block35_2_mixed", "class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "block35_2_mixed"}}, {"inbound_nodes": [[["block35_2_mixed", 0, 0, {}]]], "name": "block35_2_conv", "class_name": "Conv2D", "config": {"trainable": true, "name": "block35_2_conv", "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 320, "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["block35_1_ac", 0, 0, {}], ["block35_2_conv", 0, 0, {}]]], "name": "block35_2", "class_name": "Lambda", "config": {"trainable": true, "output_shape_type": "raw", "name": "block35_2", "output_shape": [29, 29, 320], "function_type": "lambda", "function": ["4wIAAAAAAAAAAgAAAAMAAABTAAAAcxQAAAB8AABkAQAZfAAAZAIAGXwBABQXUykDTukAAAAA6QEA\nAACpACkC2gZpbnB1dHPaBXNjYWxlcgMAAAByAwAAAPpqL2hvbWUvbXNoYWlraDIvYW5hY29uZGEz\nL2VudnMvdGYtZ3B1L2xpYi9weXRob24zLjUvc2l0ZS1wYWNrYWdlcy9rZXJhc19hcHBsaWNhdGlv\nbnMvaW5jZXB0aW9uX3Jlc25ldF92Mi5wedoIPGxhbWJkYT6qAAAA8wAAAAA=\n", null, null], "arguments": {"scale": 0.17}}}, {"inbound_nodes": [[["block35_2", 0, 0, {}]]], "name": "block35_2_ac", "class_name": "Activation", "config": {"trainable": true, "name": "block35_2_ac", "activation": "relu"}}, {"inbound_nodes": [[["block35_2_ac", 0, 0, {}]]], "name": "conv2d_28", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_28", "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["conv2d_28", 0, 0, {}]]], "name": "batch_normalization_28", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_28", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]], "name": "activation_28", "class_name": "Activation", "config": {"trainable": true, "name": "activation_28", "activation": "relu"}}, {"inbound_nodes": [[["block35_2_ac", 0, 0, {}]]], "name": "conv2d_26", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_26", "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["activation_28", 0, 0, {}]]], "name": "conv2d_29", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_29", "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 48, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["conv2d_26", 0, 0, {}]]], "name": "batch_normalization_26", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_26", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["conv2d_29", 0, 0, {}]]], "name": "batch_normalization_29", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_29", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["batch_normalization_26", 0, 0, {}]]], "name": "activation_26", "class_name": "Activation", "config": {"trainable": true, "name": "activation_26", "activation": "relu"}}, {"inbound_nodes": [[["batch_normalization_29", 0, 0, {}]]], "name": "activation_29", "class_name": "Activation", "config": {"trainable": true, "name": "activation_29", "activation": "relu"}}, {"inbound_nodes": [[["block35_2_ac", 0, 0, {}]]], "name": "conv2d_25", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_25", "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["activation_26", 0, 0, {}]]], "name": "conv2d_27", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_27", "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["activation_29", 0, 0, {}]]], "name": "conv2d_30", "class_name": "Conv2D", "config": {"trainable": true, "name": "conv2d_30", "padding": "same", "data_format": "channels_last", "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "strides": [1, 1], "use_bias": false, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1]}}, {"inbound_nodes": [[["conv2d_25", 0, 0, {}]]], "name": "batch_normalization_25", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_25", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["conv2d_27", 0, 0, {}]]], "name": "batch_normalization_27", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_27", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["conv2d_30", 0, 0, {}]]], "name": "batch_normalization_30", "class_name": "BatchNormalization", "config": {"trainable": true, "name": "batch_normalization_30", "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "scale": false, "axis": 3, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_regularizer": null, "gamma_constraint": null, "beta_constraint": null}}, {"inbound_nodes": [[["batch_normalization_25", 0, 0, {}]]], "name": "activation_25", "class_name": "Activation", "config": {"trainable": true, "name": "activation_25", "activation": "relu"}}, {"inbound_nodes": [[["batch_normalization_27", 0, 0, {}]]], "name": "activation_27", "class_name": "Activation", "config": {"trainable": true, "name": "activation_27", "activation": "relu"}}, {"inbound_nodes": [[["batch_normalization_30", 0, 0, {}]]], "name": "activation_30", "class_name": "Activation", "config": {"trainable": true, "name": "activation_30", "activation": "relu"}}, {"inbound_nodes": [[["activation_25", 0, 0, {}], ["activation_27", 0, 0, {}], ["activation_30", 0, 0, {}]]], "name": "block35_3_mixed", "class_name": "Concatenate", "config": {"trainable": true, "axis": 3, "name": "block35_3_mixed"}}, {"inbound_nodes": [[["block35_3_mixed", 0, 0, {}]]], "name": "block35_3_conv", "class_name": "Conv2D", "config": {"trainable": true, "name": "block35_3_conv", "padding": "same", "data_format": "channels_last", "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 320, "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", 