{"config": {"name": "model_12", "input_layers": [["image_input", 0, 0], ["words_input", 0, 0]], "layers": [{"name": "image_input", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "name": "image_input"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "vgg16", "config": {"name": "vgg16", "input_layers": [["input_4", 0, 0]], "layers": [{"name": "input_4", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "name": "input_4"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "block1_conv1", "config": {"name": "block1_conv1", "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "filters": 64, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true}, "inbound_nodes": [[["input_4", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block1_conv2", "config": {"name": "block1_conv2", "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "filters": 64, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block1_pool", "config": {"pool_size": [2, 2], "name": "block1_pool", "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "block2_conv1", "config": {"name": "block2_conv1", "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "filters": 128, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true}, "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block2_conv2", "config": {"name": "block2_conv2", "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "filters": 128, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true}, "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block2_pool", "config": {"pool_size": [2, 2], "name": "block2_pool", "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "block3_conv1", "config": {"name": "block3_conv1", "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "filters": 256, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true}, "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block3_conv2", "config": {"name": "block3_conv2", "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "filters": 256, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true}, "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block3_conv3", "config": {"name": "block3_conv3", "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "filters": 256, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true}, "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block3_pool", "config": {"pool_size": [2, 2], "name": "block3_pool", "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "block4_conv1", "config": {"name": "block4_conv1", "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "filters": 512, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true}, "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block4_conv2", "config": {"name": "block4_conv2", "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "filters": 512, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true}, "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block4_conv3", "config": {"name": "block4_conv3", "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "filters": 512, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true}, "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block4_pool", "config": {"pool_size": [2, 2], "name": "block4_pool", "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "block5_conv1", "config": {"name": "block5_conv1", "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "filters": 512, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true}, "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block5_conv2", "config": {"name": "block5_conv2", "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "filters": 512, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true}, "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block5_conv3", "config": {"name": "block5_conv3", "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "filters": 512, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "kernel_size": [3, 3], "use_bias": true}, "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block5_pool", "config": {"pool_size": [2, 2], "name": "block5_pool", "padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "class_name": "MaxPooling2D"}], "output_layers": [["block5_pool", 0, 0]]}, "inbound_nodes": [[["image_input", 0, 0, {}]]], "class_name": "Model"}, {"name": "words_input", "config": {"batch_input_shape": [null, 20], "dtype": "float32", "sparse": false, "name": "words_input"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "dropout_12", "config": {"name": "dropout_12", "trainable": true, "rate": 0.3, "noise_shape": null, "seed": null}, "inbound_nodes": [[["vgg16", 1, 0, {}]]], "class_name": "Dropout"}, {"name": "textModel", "config": {"name": "textModel", "input_layers": [["words_input", 0, 0]], "layers": [{"name": "words_input", "config": {"batch_input_shape": [null, 20], "dtype": "float32", "sparse": false, "name": "words_input"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "w2v_emb", "config": {"name": "w2v_emb", "input_length": null, "mask_zero": false, "output_dim": 300, "dtype": "float32", "embeddings_regularizer": null, "embeddings_constraint": null, "embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "batch_input_shape": [null, null], "input_dim": 1943, "activity_regularizer": null, "trainable": true}, "inbound_nodes": [[["words_input", 0, 0, {}]]], "class_name": "Embedding"}, {"name": "conv1d_22", "config": {"name": "conv1d_22", "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1], "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "filters": 300, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1], "kernel_size": [3], "use_bias": true}, "inbound_nodes": [[["w2v_emb", 0, 0, {}]]], "class_name": "Conv1D"}, {"name": "conv1d_23", "config": {"name": "conv1d_23", "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1], "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "filters": 300, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [2], "kernel_size": [3], "use_bias": true}, "inbound_nodes": [[["w2v_emb", 0, 0, {}]]], "class_name": "Conv1D"}, {"name": "conv1d_24", "config": {"name": "conv1d_24", "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1], "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "filters": 300, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1], "kernel_size": [5], "use_bias": true}, "inbound_nodes": [[["w2v_emb", 0, 0, {}]]], "class_name": "Conv1D"}, {"name": "conv1d_25", "config": {"name": "conv1d_25", "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1], "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "filters": 300, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [2], "kernel_size": [5], "use_bias": true}, "inbound_nodes": [[["w2v_emb", 0, 0, {}]]], "class_name": "Conv1D"}, {"name": "conv1d_26", "config": {"name": "conv1d_26", "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1], "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "filters": 300, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1], "kernel_size": [7], "use_bias": true}, "inbound_nodes": [[["w2v_emb", 0, 0, {}]]], "class_name": "Conv1D"}, {"name": "conv1d_27", "config": {"name": "conv1d_27", "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1], "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "filters": 300, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [2], "kernel_size": [7], "use_bias": true}, "inbound_nodes": [[["w2v_emb", 0, 0, {}]]], "class_name": "Conv1D"}, {"name": "concatenate_7", "config": {"name": "concatenate_7", "trainable": true, "axis": -1}, "inbound_nodes": [[["conv1d_22", 0, 0, {}], ["conv1d_23", 0, 0, {}], ["conv1d_24", 0, 0, {}], ["conv1d_25", 0, 0, {}], ["conv1d_26", 0, 0, {}], ["conv1d_27", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "conv1d_28", "config": {"name": "conv1d_28", "bias_regularizer": null, "padding": "same", "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1], "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "filters": 300, "data_format": "channels_last", "kernel_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1], "kernel_size": [1], "use_bias": true}, "inbound_nodes": [[["concatenate_7", 0, 0, {}]]], "class_name": "Conv1D"}, {"name": "batch_normalization_112", "config": {"momentum": 0.99, "name": "batch_normalization_112", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["conv1d_28", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "sa10", "config": {"name": "sa10", "trainable": true}, "inbound_nodes": [[["batch_normalization_112", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "sa11", "config": {"name": "sa11", "trainable": true}, "inbound_nodes": [[["batch_normalization_112", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "sa12", "config": {"name": "sa12", "trainable": true}, "inbound_nodes": [[["batch_normalization_112", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "sa13", "config": {"name": "sa13", "trainable": true}, "inbound_nodes": [[["batch_normalization_112", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "sa14", "config": {"name": "sa14", "trainable": true}, "inbound_nodes": [[["batch_normalization_112", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "sa15", "config": {"name": "sa15", "trainable": true}, "inbound_nodes": [[["batch_normalization_112", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "sa16", "config": {"name": "sa16", "trainable": true}, "inbound_nodes": [[["batch_normalization_112", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "sa17", "config": {"name": "sa17", "trainable": true}, "inbound_nodes": [[["batch_normalization_112", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "batch_normalization_113", "config": {"momentum": 0.99, "name": "batch_normalization_113", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa10", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_114", "config": {"momentum": 0.99, "name": "batch_normalization_114", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa11", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_115", "config": {"momentum": 0.99, "name": "batch_normalization_115", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa12", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_116", "config": {"momentum": 0.99, "name": "batch_normalization_116", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa13", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_117", "config": {"momentum": 0.99, "name": "batch_normalization_117", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa14", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_118", "config": {"momentum": 0.99, "name": "batch_normalization_118", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa15", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_119", "config": {"momentum": 0.99, "name": "batch_normalization_119", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa16", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_120", "config": {"momentum": 0.99, "name": "batch_normalization_120", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa17", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "concat_selfattn_1", "config": {"name": "concat_selfattn_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_113", 0, 0, {}], ["batch_normalization_114", 0, 0, {}], ["batch_normalization_115", 0, 0, {}], ["batch_normalization_116", 0, 0, {}], ["batch_normalization_117", 0, 0, {}], ["batch_normalization_118", 0, 0, {}], ["batch_normalization_119", 0, 0, {}], ["batch_normalization_120", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "condense_attention1d_13", "config": {"name": "condense_attention1d_13", "trainable": true}, "inbound_nodes": [[["concat_selfattn_1", 0, 0, {}]]], "class_name": "CondenseAttention1D"}, {"name": "residual_combine_selfattn_1", "config": {"name": "residual_combine_selfattn_1", "trainable": true}, "inbound_nodes": [[["batch_normalization_112", 0, 0, {}], ["condense_attention1d_13", 0, 0, {}]]], "class_name": "ResidualCombine"}, {"name": "batch_normalization_121", "config": {"momentum": 0.99, "name": "batch_normalization_121", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["residual_combine_selfattn_1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "sa20", "config": {"name": "sa20", "trainable": true}, "inbound_nodes": [[["batch_normalization_121", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "sa21", "config": {"name": "sa21", "trainable": true}, "inbound_nodes": [[["batch_normalization_121", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "sa22", "config": {"name": "sa22", "trainable": true}, "inbound_nodes": [[["batch_normalization_121", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "sa23", "config": {"name": "sa23", "trainable": true}, "inbound_nodes": [[["batch_normalization_121", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "sa24", "config": {"name": "sa24", "trainable": true}, "inbound_nodes": [[["batch_normalization_121", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "sa25", "config": {"name": "sa25", "trainable": true}, "inbound_nodes": [[["batch_normalization_121", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "sa26", "config": {"name": "sa26", "trainable": true}, "inbound_nodes": [[["batch_normalization_121", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "sa27", "config": {"name": "sa27", "trainable": true}, "inbound_nodes": [[["batch_normalization_121", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "batch_normalization_122", "config": {"momentum": 0.99, "name": "batch_normalization_122", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa20", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_123", "config": {"momentum": 0.99, "name": "batch_normalization_123", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa21", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_124", "config": {"momentum": 0.99, "name": "batch_normalization_124", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa22", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_125", "config": {"momentum": 0.99, "name": "batch_normalization_125", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa23", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_126", "config": {"momentum": 0.99, "name": "batch_normalization_126", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa24", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_127", "config": {"momentum": 0.99, "name": "batch_normalization_127", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa25", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_128", "config": {"momentum": 0.99, "name": "batch_normalization_128", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa26", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_129", "config": {"momentum": 0.99, "name": "batch_normalization_129", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa27", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "concat_selfattn_2", "config": {"name": "concat_selfattn_2", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_122", 0, 0, {}], ["batch_normalization_123", 0, 0, {}], ["batch_normalization_124", 0, 0, {}], ["batch_normalization_125", 0, 0, {}], ["batch_normalization_126", 0, 0, {}], ["batch_normalization_127", 0, 0, {}], ["batch_normalization_128", 0, 0, {}], ["batch_normalization_129", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "condense_attention1d_14", "config": {"name": "condense_attention1d_14", "trainable": true}, "inbound_nodes": [[["concat_selfattn_2", 0, 0, {}]]], "class_name": "CondenseAttention1D"}, {"name": "residual_combine_selfattn_2", "config": {"name": "residual_combine_selfattn_2", "trainable": true}, "inbound_nodes": [[["batch_normalization_121", 0, 0, {}], ["condense_attention1d_14", 0, 0, {}]]], "class_name": "ResidualCombine"}, {"name": "batch_normalization_130", "config": {"momentum": 0.99, "name": "batch_normalization_130", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["residual_combine_selfattn_2", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "sa30", "config": {"name": "sa30", "trainable": true}, "inbound_nodes": [[["batch_normalization_130", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "sa31", "config": {"name": "sa31", "trainable": true}, "inbound_nodes": [[["batch_normalization_130", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "sa32", "config": {"name": "sa32", "trainable": true}, "inbound_nodes": [[["batch_normalization_130", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "sa33", "config": {"name": "sa33", "trainable": true}, "inbound_nodes": [[["batch_normalization_130", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "sa34", "config": {"name": "sa34", "trainable": true}, "inbound_nodes": [[["batch_normalization_130", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "sa35", "config": {"name": "sa35", "trainable": true}, "inbound_nodes": [[["batch_normalization_130", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "sa36", "config": {"name": "sa36", "trainable": true}, "inbound_nodes": [[["batch_normalization_130", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "sa37", "config": {"name": "sa37", "trainable": true}, "inbound_nodes": [[["batch_normalization_130", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "batch_normalization_131", "config": {"momentum": 0.99, "name": "batch_normalization_131", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa30", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_132", "config": {"momentum": 0.99, "name": "batch_normalization_132", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa31", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_133", "config": {"momentum": 0.99, "name": "batch_normalization_133", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa32", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_134", "config": {"momentum": 0.99, "name": "batch_normalization_134", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa33", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_135", "config": {"momentum": 0.99, "name": "batch_normalization_135", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa34", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_136", "config": {"momentum": 0.99, "name": "batch_normalization_136", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa35", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_137", "config": {"momentum": 0.99, "name": "batch_normalization_137", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa36", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_138", "config": {"momentum": 0.99, "name": "batch_normalization_138", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa37", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "concat_selfattn_3", "config": {"name": "concat_selfattn_3", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_131", 0, 0, {}], ["batch_normalization_132", 0, 0, {}], ["batch_normalization_133", 0, 0, {}], ["batch_normalization_134", 0, 0, {}], ["batch_normalization_135", 0, 0, {}], ["batch_normalization_136", 0, 0, {}], ["batch_normalization_137", 0, 0, {}], ["batch_normalization_138", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "condense_attention1d_15", "config": {"name": "condense_attention1d_15", "trainable": true}, "inbound_nodes": [[["concat_selfattn_3", 0, 0, {}]]], "class_name": "CondenseAttention1D"}, {"name": "residual_combine_selfattn_3", "config": {"name": "residual_combine_selfattn_3", "trainable": true}, "inbound_nodes": [[["batch_normalization_130", 0, 0, {}], ["condense_attention1d_15", 0, 0, {}]]], "class_name": "ResidualCombine"}, {"name": "batch_normalization_139", "config": {"momentum": 0.99, "name": "batch_normalization_139", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["residual_combine_selfattn_3", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "sa40", "config": {"name": "sa40", "trainable": true}, "inbound_nodes": [[["batch_normalization_139", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "sa41", "config": {"name": "sa41", "trainable": true}, "inbound_nodes": [[["batch_normalization_139", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "sa42", "config": {"name": "sa42", "trainable": true}, "inbound_nodes": [[["batch_normalization_139", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "sa43", "config": {"name": "sa43", "trainable": true}, "inbound_nodes": [[["batch_normalization_139", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "sa44", "config": {"name": "sa44", "trainable": true}, "inbound_nodes": [[["batch_normalization_139", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "sa45", "config": {"name": "sa45", "trainable": true}, "inbound_nodes": [[["batch_normalization_139", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "sa46", "config": {"name": "sa46", "trainable": true}, "inbound_nodes": [[["batch_normalization_139", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "sa47", "config": {"name": "sa47", "trainable": true}, "inbound_nodes": [[["batch_normalization_139", 0, 0, {}]]], "class_name": "SelfAttention"}, {"name": "batch_normalization_140", "config": {"momentum": 0.99, "name": "batch_normalization_140", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa40", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_141", "config": {"momentum": 0.99, "name": "batch_normalization_141", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa41", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_142", "config": {"momentum": 0.99, "name": "batch_normalization_142", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa42", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_143", "config": {"momentum": 0.99, "name": "batch_normalization_143", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa43", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_144", "config": {"momentum": 0.99, "name": "batch_normalization_144", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa44", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_145", "config": {"momentum": 0.99, "name": "batch_normalization_145", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa45", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_146", "config": {"momentum": 0.99, "name": "batch_normalization_146", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa46", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_147", "config": {"momentum": 0.99, "name": "batch_normalization_147", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["sa47", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "concat_selfattn_4", "config": {"name": "concat_selfattn_4", "trainable": true, "axis": -1}, "inbound_nodes": [[["batch_normalization_140", 0, 0, {}], ["batch_normalization_141", 0, 0, {}], ["batch_normalization_142", 0, 0, {}], ["batch_normalization_143", 0, 0, {}], ["batch_normalization_144", 0, 0, {}], ["batch_normalization_145", 0, 0, {}], ["batch_normalization_146", 0, 0, {}], ["batch_normalization_147", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "condense_attention1d_16", "config": {"name": "condense_attention1d_16", "trainable": true}, "inbound_nodes": [[["concat_selfattn_4", 0, 0, {}]]], "class_name": "CondenseAttention1D"}, {"name": "residual_combine_selfattn_4", "config": {"name": "residual_combine_selfattn_4", "trainable": true}, "inbound_nodes": [[["batch_normalization_139", 0, 0, {}], ["condense_attention1d_16", 0, 0, {}]]], "class_name": "ResidualCombine"}, {"name": "batch_normalization_148", "config": {"momentum": 0.99, "name": "batch_normalization_148", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null}, "inbound_nodes": [[["residual_combine_selfattn_4", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "gap", "config": {"name": "gap", "trainable": true}, "inbound_nodes": [[["batch_normalization_148", 0, 0, {}]]], "class_name": "GlobalAveragePooling1D"}, {"name": "a10", "config": {"name": "a10", "trainable": true}, "inbound_nodes": [[["gap", 0, 0, {}], ["batch_normalization_148", 0, 0, {}]]], "class_name": "Attention"}, {"name": "a11", "config": {"name": "a11", "trainable": true}, "inbound_nodes": [[["gap", 0, 0, {}], ["batch_normalization_148", 0, 0, {}]]], "class_name": "Attention"}, {"name": "a12", "config": {"name": "a12", "trainable": true}, "inbound_nodes": [[["gap", 0, 0, {}], ["batch_normalization_148", 0, 0, {}]]], "class_name": "Attention"}, {"name": "a13", "config": {"name": "a13", "trainable": true}, "inbound_nodes": [[["gap", 0, 0, {}], ["batch_normalization_148", 0, 0, {}]]], "class_name": "Attention"}, {"name": "a14", "config": {"name": "a14", "trainable": true}, "inbound_nodes": [[["gap", 0, 0, {}], ["batch_normalization_148", 0, 0, {}]]], "class_name": "Attention"}, {"name": "a15", "config": {"name": "a15", "trainable": true}, "inbound_nodes": [[["gap", 0, 0, {}], ["batch_normalization_148", 0, 0, {}]]], "class_name": "Attention"}, {"name": "a16", "config": {"name": "a16", "trainable": true}, "inbound_nodes": [[["gap", 0, 0, {}], ["batch_normalization_148", 0, 0, {}]]], "class_name": "Attention"}, {"name": "a17", "config": {"name": "a17", "trainable": true}, "inbound_nodes": [[["gap", 0, 0, {}], ["batch_normalization_148", 0, 0, {}]]], "class_name": "Attention"}, {"name": "batch_normalization_149", "config": {"momentum": 0.99, "name": "batch_normalization_149", "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "trainable": true, "center": true, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, 