{"class_name": "Model", "config": {"input_layers": [["image_input", 0, 0], ["words_input", 0, 0], ["padding_masks", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 256, 256, 3], "sparse": false, "name": "image_input"}, "name": "image_input", "inbound_nodes": []}, {"class_name": "Model", "config": {"input_layers": [["image_input", 0, 0]], "name": "imgModel", "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "name": "image_input", "sparse": false, "batch_input_shape": [null, 256, 256, 3]}, "name": "image_input", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "filters": 64, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "padding": "same", "trainable": true, "name": "block1_conv1"}, "name": "block1_conv1", "inbound_nodes": [[["image_input", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "filters": 64, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "padding": "same", "trainable": true, "name": "block1_conv2"}, "name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [2, 2], "filters": 64, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_constraint": null, "strides": [2, 2], "activation": "relu", "padding": "same", "trainable": true, "name": "block1_reduction_conv"}, "name": "block1_reduction_conv", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "trainable": true, "name": "batch_normalization_1"}, "name": "batch_normalization_1", "inbound_nodes": [[["block1_reduction_conv", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "name": "dropout_1", "seed": null}, "name": "dropout_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "filters": 128, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "padding": "same", "trainable": true, "name": "block2_conv1"}, "name": "block2_conv1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "filters": 128, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "padding": "same", "trainable": true, "name": "block2_conv2"}, "name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [2, 2], "filters": 128, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_constraint": null, "strides": [2, 2], "activation": "relu", "padding": "same", "trainable": true, "name": "block2_reduction_conv"}, "name": "block2_reduction_conv", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "trainable": true, "name": "batch_normalization_2"}, "name": "batch_normalization_2", "inbound_nodes": [[["block2_reduction_conv", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "name": "dropout_2", "seed": null}, "name": "dropout_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "filters": 256, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "padding": "same", "trainable": true, "name": "block3_conv1"}, "name": "block3_conv1", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "filters": 256, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "padding": "same", "trainable": true, "name": "block3_conv2"}, "name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "filters": 256, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "padding": "same", "trainable": true, "name": "block3_conv3"}, "name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [2, 2], "filters": 256, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_constraint": null, "strides": [2, 2], "activation": "relu", "padding": "same", "trainable": true, "name": "block3_reduction_conv"}, "name": "block3_reduction_conv", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "trainable": true, "name": "batch_normalization_3"}, "name": "batch_normalization_3", "inbound_nodes": [[["block3_reduction_conv", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "name": "dropout_3", "seed": null}, "name": "dropout_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "filters": 512, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "padding": "same", "trainable": true, "name": "block4_conv1"}, "name": "block4_conv1", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "filters": 512, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "padding": "same", "trainable": true, "name": "block4_conv2"}, "name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "filters": 512, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "padding": "same", "trainable": true, "name": "block4_conv3"}, "name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [2, 2], "filters": 512, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_constraint": null, "strides": [2, 2], "activation": "relu", "padding": "same", "trainable": true, "name": "block4_reduction_conv"}, "name": "block4_reduction_conv", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "trainable": true, "name": "batch_normalization_4"}, "name": "batch_normalization_4", "inbound_nodes": [[["block4_reduction_conv", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"rate": 0.5, "noise_shape": null, "trainable": true, "name": "dropout_4", "seed": null}, "name": "dropout_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "filters": 512, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "padding": "same", "trainable": true, "name": "block5_conv1"}, "name": "block5_conv1", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "filters": 512, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "padding": "same", "trainable": true, "name": "block5_conv2"}, "name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [3, 3], "filters": 512, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_constraint": null, "strides": [1, 1], "activation": "relu", "padding": "same", "trainable": true, "name": "block5_conv3"}, "name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "kernel_size": [2, 2], "filters": 512, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_constraint": null, "strides": [2, 2], "activation": "relu", "padding": "same", "trainable": true, "name": "block5_reduction_conv"}, "name": "block5_reduction_conv", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}], "output_layers": [["block5_reduction_conv", 0, 0]]}, "name": "imgModel", "inbound_nodes": [[["image_input", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 193], "sparse": false, "name": "words_input"}, "name": "words_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 193, 1], "sparse": false, "name": "padding_masks"}, "name": "padding_masks", "inbound_nodes": []}, {"class_name": "Dropout", "config": {"rate": 0.6, "name": "dropout_5", "trainable": true, "noise_shape": null, "seed": null}, "name": "dropout_5", "inbound_nodes": [[["imgModel", 1, 0, {}]]]}, {"class_name": "Model", "config": {"input_layers": [["words_input", 0, 0], ["padding_masks", 0, 0]], "name": "textModel", "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "name": "words_input", "sparse": false, "batch_input_shape": [null, 193]}, "name": "words_input", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"output_dim": 300, "name": "w2v_emb", "embeddings_regularizer": null, "mask_zero": false, "dtype": "float32", "activity_regularizer": null, "input_dim": 1943, "input_length": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "minval": -0.05, "seed": null}}, "embeddings_constraint": null, "trainable": true, "batch_input_shape": [null, null]}, "name": "w2v_emb", "inbound_nodes": [[["words_input", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "kernel_regularizer": null, "return_state": false, "recurrent_regularizer": null, "stateful": false, "trainable": true, "name": "lstm_1", "return_sequences": true, "use_bias": true, "implementation": 1, "go_backwards": false, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "activation": "relu", "units": 512, "recurrent_dropout": 0.0, "unroll": false, "recurrent_constraint": null}, "name": "lstm_1", "inbound_nodes": [[["w2v_emb", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"dtype": "float32", "name": "padding_masks", "sparse": false, "batch_input_shape": [null, 193, 1]}, "name": "padding_masks", "inbound_nodes": []}, {"class_name": "SelfAttention", "config": {"trainable": true, "name": "self_attention_1"}, "name": "self_attention_1", "inbound_nodes": [[["lstm_1", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"trainable": true, "name": "self_attention_2"}, "name": "self_attention_2", "inbound_nodes": [[["lstm_1", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"trainable": true, "name": "self_attention_3"}, "name": "self_attention_3", "inbound_nodes": [[["lstm_1", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"trainable": true, "name": "self_attention_4"}, "name": "self_attention_4", "inbound_nodes": [[["lstm_1", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": -1, "trainable": true, "name": "concatenate_1"}, "name": "concatenate_1", "inbound_nodes": [[["self_attention_1", 0, 0, {}], ["self_attention_2", 0, 0, {}], ["self_attention_3", 0, 0, {}], ["self_attention_4", 0, 0, {}]]]}, {"class_name": "ResidualCombine", "config": {"trainable": true, "name": "residual_combine_1"}, "name": "residual_combine_1", "inbound_nodes": [[["lstm_1", 0, 0, {}], ["concatenate_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "trainable": true, "name": "batch_normalization_5"}, "name": "batch_normalization_5", "inbound_nodes": [[["residual_combine_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "name": "activation_1", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unit_forget_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "kernel_regularizer": null, "return_state": false, "recurrent_regularizer": null, "stateful": false, "trainable": true, "name": "lstm_2", "return_sequences": false, "use_bias": true, "implementation": 1, "go_backwards": false, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "activation": "relu", "units": 512, "recurrent_dropout": 0.0, "unroll": false, "recurrent_constraint": null}, "name": "lstm_2", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu", "units": 1024, "trainable": true, "name": "dense_1"}, "name": "dense_1", "inbound_nodes": [[["lstm_2", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcxYAAAB0AABqAQBqAgB8AABkAQBkAgCDAQFTKQNO2gRheGlz\n6QEAAAApA9oBS9oCdGbaC2V4cGFuZF9kaW1zKQHaAXipAHIHAAAA+h88aXB5dGhvbi1pbnB1dC0y\nMi03NTVmMjY5MDI4NmE+2gg8bGFtYmRhPhcAAABzAAAAAA==\n", null, null], "arguments": {}, "trainable": true, "name": "dense_expand_dims", "function_type": "lambda", "output_shape": null}, "name": "dense_expand_dims", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Attention", "config": {"trainable": true, "name": "attention_1"}, "name": "attention_1", "inbound_nodes": [[["dense_expand_dims", 0, 0, {}], ["activation_1", 0, 0, {}]]]}, {"class_name": "Attention", "config": {"trainable": true, "name": "attention_2"}, "name": "attention_2", "inbound_nodes": [[["dense_expand_dims", 0, 0, {}], ["activation_1", 0, 0, {}]]]}, {"class_name": "Attention", "config": {"trainable": true, "name": "attention_3"}, "name": "attention_3", "inbound_nodes": [[["dense_expand_dims", 0, 0, {}], ["activation_1", 0, 0, {}]]]}, {"class_name": "Attention", "config": {"trainable": true, "name": "attention_4"}, "name": "attention_4", "inbound_nodes": [[["dense_expand_dims", 0, 0, {}], ["activation_1", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": -1, "trainable": true, "name": "concatenate_2"}, "name": "concatenate_2", "inbound_nodes": [[["attention_1", 0, 0, {}], ["attention_2", 0, 0, {}], ["attention_3", 0, 0, {}], ["attention_4", 0, 0, {}]]]}, {"class_name": "ResidualCombine", "config": {"trainable": true, "name": "residual_combine_2"}, "name": "residual_combine_2", "inbound_nodes": [[["dense_expand_dims", 0, 0, {}], ["concatenate_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "gamma_regularizer": null, "beta_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "trainable": true, "name": "batch_normalization_6"}, "name": "batch_normalization_6", "inbound_nodes": [[["residual_combine_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "name": "activation_2", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"output_shape_type": "raw", "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcxYAAAB0AABqAQBqAgB8AABkAQBkAgCDAQFTKQNO2gRheGlz\n6QEAAAApA9oBS9oCdGbaB3NxdWVlemUpAdoBeKkAcgcAAAD6HzxpcHl0aG9uLWlucHV0LTIyLTc1\nNWYyNjkwMjg2YT7aCDxsYW1iZGE+JQAAAHMAAAAA\n", null, null], "arguments": {}, "trainable": true, "name": "squeeze_out_vector", "function_type": "lambda", "output_shape": null}, "name": "squeeze_out_vector", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}], "output_layers": [["squeeze_out_vector", 0, 0]]}, "name": "textModel", "inbound_nodes": [[["words_input", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "name": "flatten_1", "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"rate": 0.6, "name": "dropout_6", "trainable": true, "noise_shape": null, "seed": null}, "name": "dropout_6", "inbound_nodes": [[["textModel", 1, 0, {}]]]}, {"class_name": "Dense", "config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu", "units": 512, "trainable": true, "name": "dense_2"}, "name": "dense_2", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_constraint": null, "activation": "relu", "units": 512, "trainable": true, "name": "dense_3"}, "name": "dense_3", "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": -1, "trainable": true, "name": "concatenate_3"}, "name": "concatenate_3", "inbound_nodes": [[["dense_2", 0, 0, {}], ["dense_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_constraint": null, "activation": "softmax", "units": 1943, "trainable": true, "name": "target_word"}, "name": "target_word", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}], "output_layers": [["target_word", 0, 0]]}, "keras_version": "2.2.2", "backend": "tensorflow"}