{"keras_version": "2.2.2", "backend": "tensorflow", "config": {"output_layers": [["target_word", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "sparse": false, "dtype": "float32", "name": "image_input"}, "name": "image_input", "inbound_nodes": []}, {"class_name": "Model", "config": {"output_layers": [["block5_reduction_conv", 0, 0]], "layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, 256, 256, 3], "sparse": false, "dtype": "float32", "name": "image_input"}, "name": "image_input", "class_name": "InputLayer"}, {"inbound_nodes": [[["image_input", 0, 0, {}]]], "config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 64, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "block1_conv1", "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "data_format": "channels_last"}, "name": "block1_conv1", "class_name": "Conv2D"}, {"inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 64, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "block1_conv2", "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "data_format": "channels_last"}, "name": "block1_conv2", "class_name": "Conv2D"}, {"inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 64, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "block1_reduction_conv", "bias_regularizer": null, "use_bias": true, "strides": [2, 2], "bias_constraint": null, "kernel_size": [2, 2], "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "data_format": "channels_last"}, "name": "block1_reduction_conv", "class_name": "Conv2D"}, {"inbound_nodes": [[["block1_reduction_conv", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_5", "epsilon": 0.001, "gamma_constraint": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_regularizer": null}, "name": "batch_normalization_5", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"noise_shape": null, "trainable": true, "rate": 0.5, "name": "dropout_9", "seed": null}, "name": "dropout_9", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_9", 0, 0, {}]]], "config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 128, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "block2_conv1", "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "data_format": "channels_last"}, "name": "block2_conv1", "class_name": "Conv2D"}, {"inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 128, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "block2_conv2", "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "data_format": "channels_last"}, "name": "block2_conv2", "class_name": "Conv2D"}, {"inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 128, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "block2_reduction_conv", "bias_regularizer": null, "use_bias": true, "strides": [2, 2], "bias_constraint": null, "kernel_size": [2, 2], "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "data_format": "channels_last"}, "name": "block2_reduction_conv", "class_name": "Conv2D"}, {"inbound_nodes": [[["block2_reduction_conv", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_6", "epsilon": 0.001, "gamma_constraint": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_regularizer": null}, "name": "batch_normalization_6", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"noise_shape": null, "trainable": true, "rate": 0.5, "name": "dropout_10", "seed": null}, "name": "dropout_10", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_10", 0, 0, {}]]], "config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 256, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "block3_conv1", "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "data_format": "channels_last"}, "name": "block3_conv1", "class_name": "Conv2D"}, {"inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 256, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "block3_conv2", "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "data_format": "channels_last"}, "name": "block3_conv2", "class_name": "Conv2D"}, {"inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 256, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "block3_conv3", "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "data_format": "channels_last"}, "name": "block3_conv3", "class_name": "Conv2D"}, {"inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 256, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "block3_reduction_conv", "bias_regularizer": null, "use_bias": true, "strides": [2, 2], "bias_constraint": null, "kernel_size": [2, 2], "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "data_format": "channels_last"}, "name": "block3_reduction_conv", "class_name": "Conv2D"}, {"inbound_nodes": [[["block3_reduction_conv", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_7", "epsilon": 0.001, "gamma_constraint": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_regularizer": null}, "name": "batch_normalization_7", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"noise_shape": null, "trainable": true, "rate": 0.5, "name": "dropout_11", "seed": null}, "name": "dropout_11", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_11", 0, 0, {}]]], "config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 512, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "block4_conv1", "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "data_format": "channels_last"}, "name": "block4_conv1", "class_name": "Conv2D"}, {"inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 512, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "block4_conv2", "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "data_format": "channels_last"}, "name": "block4_conv2", "class_name": "Conv2D"}, {"inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 512, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "block4_conv3", "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "data_format": "channels_last"}, "name": "block4_conv3", "class_name": "Conv2D"}, {"inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 512, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "block4_reduction_conv", "bias_regularizer": null, "use_bias": true, "strides": [2, 2], "bias_constraint": null, "kernel_size": [2, 2], "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "data_format": "channels_last"}, "name": "block4_reduction_conv", "class_name": "Conv2D"}, {"inbound_nodes": [[["block4_reduction_conv", 0, 0, {}]]], "config": {"beta_constraint": null, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_8", "epsilon": 0.001, "gamma_constraint": null, "center": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "momentum": 0.99, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "gamma_regularizer": null}, "name": "batch_normalization_8", "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"noise_shape": null, "trainable": true, "rate": 0.5, "name": "dropout_12", "seed": null}, "name": "dropout_12", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_12", 0, 0, {}]]], "config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 512, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "block5_conv1", "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "data_format": "channels_last"}, "name": "block5_conv1", "class_name": "Conv2D"}, {"inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 512, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "block5_conv2", "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "data_format": "channels_last"}, "name": "block5_conv2", "class_name": "Conv2D"}, {"inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 512, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "block5_conv3", "bias_regularizer": null, "use_bias": true, "strides": [1, 1], "bias_constraint": null, "kernel_size": [3, 3], "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "data_format": "channels_last"}, "name": "block5_conv3", "class_name": "Conv2D"}, {"inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "config": {"padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 512, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "block5_reduction_conv", "bias_regularizer": null, "use_bias": true, "strides": [2, 2], "bias_constraint": null, "kernel_size": [2, 2], "activity_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "data_format": "channels_last"}, "name": "block5_reduction_conv", "class_name": "Conv2D"}], "input_layers": [["image_input", 0, 0]], "name": "imgModel"}, "name": "imgModel", "inbound_nodes": [[["image_input", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "global_average_pooling2d_3", "data_format": "channels_last"}, "name": "global_average_pooling2d_3", "inbound_nodes": [[["imgModel", 1, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "rate": 0.5, "name": "dropout_13", "seed": null}, "name": "dropout_13", "inbound_nodes": [[["global_average_pooling2d_3", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 193], "sparse": false, "dtype": "float32", "name": "words_input"}, "name": "words_input", "inbound_nodes": []}, {"class_name": "Dense", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_5", "units": 256, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null}, "name": "dense_5", "inbound_nodes": [[["dropout_13", 0, 0, {}]]]}, {"class_name": "Model", "config": {"output_layers": [["lstm_2", 0, 0]], "layers": [{"inbound_nodes": [], "config": {"batch_input_shape": [null, 193], "sparse": false, "dtype": "float32", "name": "words_input"}, "name": "words_input", "class_name": "InputLayer"}, {"inbound_nodes": [[["words_input", 0, 0, {}]]], "config": {"embeddings_constraint": null, "output_dim": 300, "dtype": "float32", "name": "w2v_emb", "input_length": null, "batch_input_shape": [null, null], "activity_regularizer": null, "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "trainable": true, "input_dim": 1942, "mask_zero": true, "embeddings_regularizer": null}, "name": "w2v_emb", "class_name": "Embedding"}, {"inbound_nodes": [[["w2v_emb", 0, 0, {}]]], "config": {"noise_shape": null, "trainable": true, "rate": 0.5, "name": "dropout_8", "seed": null}, "name": "dropout_8", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_8", 0, 0, {}]]], "config": {"dropout": 0.0, "kernel_constraint": null, "implementation": 1, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "lstm_2", "units": 256, "trainable": true, "recurrent_dropout": 0.0, "recurrent_constraint": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "activation": "relu", "recurrent_regularizer": null, "unroll": false, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "return_sequences": false, "go_backwards": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "recurrent_activation": "hard_sigmoid", "stateful": false, "unit_forget_bias": true, "kernel_regularizer": null}, "name": "lstm_2", "class_name": "LSTM"}], "input_layers": [["words_input", 0, 0]], "name": "textModel"}, "name": "textModel", "inbound_nodes": [[["words_input", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": -1, "trainable": true, "name": "concatenate_3"}, "name": "concatenate_3", "inbound_nodes": [[["dense_5", 0, 0, {}], ["textModel", 1, 0, {}]]]}, {"class_name": "Dense", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_6", "units": 256, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null}, "name": "dense_6", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "softmax", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "name": "target_word", "units": 1942, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null}, "name": "target_word", "inbound_nodes": [[["dense_6", 0, 0, {}]]]}], "input_layers": [["image_input", 0, 0], ["words_input", 0, 0]], "name": "model_5"}, "class_name": "Model"}