{"class_name": "Model", "backend": "tensorflow", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "name": "image_input", "config": {"sparse": false, "name": "image_input", "batch_input_shape": [null, 256, 256, 3], "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Model", "name": "imgModel", "config": {"name": "imgModel", "layers": [{"class_name": "InputLayer", "name": "image_input", "config": {"sparse": false, "name": "image_input", "batch_input_shape": [null, 256, 256, 3], "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "block1_conv1", "config": {"trainable": true, "padding": "same", "filters": 64, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block1_conv1", "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["image_input", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block1_conv2", "config": {"trainable": true, "padding": "same", "filters": 64, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block1_conv2", "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block1_reduction_conv", "config": {"trainable": true, "padding": "same", "filters": 64, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [2, 2], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block1_reduction_conv", "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [2, 2]}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_1", "beta_constraint": null}, "inbound_nodes": [[["block1_reduction_conv", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"trainable": true, "name": "dropout_1", "rate": 0.5, "seed": null, "noise_shape": null}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_conv1", "config": {"trainable": true, "padding": "same", "filters": 128, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block2_conv1", "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_conv2", "config": {"trainable": true, "padding": "same", "filters": 128, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block2_conv2", "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_reduction_conv", "config": {"trainable": true, "padding": "same", "filters": 128, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [2, 2], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block2_reduction_conv", "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [2, 2]}, "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_2", "beta_constraint": null}, "inbound_nodes": [[["block2_reduction_conv", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_2", "config": {"trainable": true, "name": "dropout_2", "rate": 0.5, "seed": null, "noise_shape": null}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv1", "config": {"trainable": true, "padding": "same", "filters": 256, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block3_conv1", "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv2", "config": {"trainable": true, "padding": "same", "filters": 256, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block3_conv2", "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv3", "config": {"trainable": true, "padding": "same", "filters": 256, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block3_conv3", "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_reduction_conv", "config": {"trainable": true, "padding": "same", "filters": 256, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [2, 2], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block3_reduction_conv", "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [2, 2]}, "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_3", "beta_constraint": null}, "inbound_nodes": [[["block3_reduction_conv", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_3", "config": {"trainable": true, "name": "dropout_3", "rate": 0.5, "seed": null, "noise_shape": null}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv1", "config": {"trainable": true, "padding": "same", "filters": 512, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block4_conv1", "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv2", "config": {"trainable": true, "padding": "same", "filters": 512, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block4_conv2", "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv3", "config": {"trainable": true, "padding": "same", "filters": 512, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block4_conv3", "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_reduction_conv", "config": {"trainable": true, "padding": "same", "filters": 512, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [2, 2], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block4_reduction_conv", "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [2, 2]}, "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"trainable": true, "gamma_regularizer": null, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "center": true, "gamma_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "name": "batch_normalization_4", "beta_constraint": null}, "inbound_nodes": [[["block4_reduction_conv", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_4", "config": {"trainable": true, "name": "dropout_4", "rate": 0.5, "seed": null, "noise_shape": null}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv1", "config": {"trainable": true, "padding": "same", "filters": 512, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block5_conv1", "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv2", "config": {"trainable": true, "padding": "same", "filters": 512, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block5_conv2", "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv3", "config": {"trainable": true, "padding": "same", "filters": 512, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block5_conv3", "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3]}, "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_reduction_conv", "config": {"trainable": true, "padding": "same", "filters": 512, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [2, 2], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "name": "block5_reduction_conv", "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [2, 2]}, "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}], "output_layers": [["block5_reduction_conv", 0, 0]], "input_layers": [["image_input", 0, 0]]}, "inbound_nodes": [[["image_input", 0, 0, {}]]]}, {"class_name": "InputLayer", "name": "words_input", "config": {"sparse": false, "name": "words_input", "batch_input_shape": [null, 193], "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Dropout", "name": "dropout_7", "config": {"trainable": true, "name": "dropout_7", "seed": null, "noise_shape": null, "rate": 0.1}, "inbound_nodes": [[["imgModel", 1, 0, {}]]]}, {"class_name": "Model", "name": "textModel", "config": {"name": "textModel", "layers": [{"class_name": "InputLayer", "name": "words_input", "config": {"sparse": false, "name": "words_input", "batch_input_shape": [null, 193], "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Embedding", "name": "w2v_emb", "config": {"trainable": true, "embeddings_regularizer": null, "dtype": "float32", "output_dim": 300, "activity_regularizer": null, "batch_input_shape": [null, null], "input_dim": 1943, "name": "w2v_emb", "mask_zero": false, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "embeddings_constraint": null, "input_length": null}, "inbound_nodes": [[["words_input", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_2", "config": {"trainable": true, "padding": "valid", "filters": 512, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "strides": [1], "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "name": "conv1d_2", "activation": "relu", "data_format": "channels_last", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3]}, "inbound_nodes": [[["w2v_emb", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_6", "config": {"trainable": true, "name": "dropout_6", "rate": 0.1, "seed": null, "noise_shape": null}, "inbound_nodes": [[["conv1d_2", 0, 0, {}]]]}, {"class_name": "SelfAttention", "name": "self_attention_2", "config": {"trainable": true, "name": "self_attention_2"}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling1D", "name": "sa_gap", "config": {"trainable": true, "name": "sa_gap"}, "inbound_nodes": [[["self_attention_2", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"trainable": true, "units": 512, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "use_bias": true, "name": "dense_2", "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}, "inbound_nodes": [[["sa_gap", 0, 0, {}]]]}, {"class_name": "Attention", "name": "attention_2", "config": {"trainable": true, "name": "attention_2"}, "inbound_nodes": [[["dense_2", 0, 0, {}], ["self_attention_2", 0, 0, {}]]]}, {"class_name": "Lambda", "name": "a_gap", "config": {"trainable": true, "arguments": {}, "function": ["4wEAAAAAAAAAAQAAAAQAAABTAAAAcxYAAAB0AABqAQBqAgB8AABkAQBkAgCDAQFTKQNO2gRheGlz\n6QEAAAApA9oBS9oCdGbaB3NxdWVlemUpAdoBeKkAcgcAAAD6HzxpcHl0aG9uLWlucHV0LTI3LWJh\nNTU3NWM1OGIyMj7aCDxsYW1iZGE+CwAAAHMAAAAA\n", null, null], "name": "a_gap", "output_shape_type": "raw", "output_shape": null, "function_type": "lambda"}, "inbound_nodes": [[["attention_2", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_2", "config": {"trainable": true, "name": "concatenate_2", "axis": -1}, "inbound_nodes": [[["a_gap", 0, 0, {}], ["dense_2", 0, 0, {}]]]}], "output_layers": [["concatenate_2", 0, 0]], "input_layers": [["words_input", 0, 0]]}, "inbound_nodes": [[["words_input", 0, 0, {}]]]}, {"class_name": "Flatten", "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_8", "config": {"trainable": true, "name": "dropout_8", "seed": null, "noise_shape": null, "rate": 0.1}, "inbound_nodes": [[["textModel", 1, 0, {}]]]}, {"class_name": "Dense", "name": "dense_3", "config": {"trainable": true, "units": 512, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_3", "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_4", "config": {"trainable": true, "units": 512, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_4", "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}, "inbound_nodes": [[["dropout_8", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_3", "config": {"trainable": true, "name": "concatenate_3", "axis": -1}, "inbound_nodes": [[["dense_3", 0, 0, {}], ["dense_4", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_5", "config": {"trainable": true, "units": 512, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_5", "activation": "relu", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"class_name": "Dense", "name": "target_word", "config": {"trainable": true, "units": 1943, "use_bias": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "target_word", "activation": "softmax", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}, "inbound_nodes": [[["dense_5", 0, 0, {}]]]}], "output_layers": [["target_word", 0, 0]], "input_layers": [["image_input", 0, 0], ["words_input", 0, 0]]}, "keras_version": "2.2.2"}