{"class_name": "Model", "config": {"name": "model_1", "input_layers": [["image_input", 0, 0], ["words_input", 0, 0], ["padding_masks", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "image_input", "config": {"name": "image_input", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 256, 256, 3]}, "inbound_nodes": []}, {"class_name": "InputLayer", "name": "words_input", "config": {"name": "words_input", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 60]}, "inbound_nodes": []}, {"class_name": "InputLayer", "name": "padding_masks", "config": {"name": "padding_masks", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 60, 1]}, "inbound_nodes": []}, {"class_name": "Model", "name": "imgModel", "config": {"name": "imgModel", "input_layers": [["image_input", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "image_input", "config": {"name": "image_input", "batch_input_shape": [null, 256, 256, 3], "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "block1_conv1", "config": {"activity_regularizer": null, "name": "block1_conv1", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "filters": 64, "data_format": "channels_last"}, "inbound_nodes": [[["image_input", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block1_conv2", "config": {"activity_regularizer": null, "name": "block1_conv2", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "filters": 64, "data_format": "channels_last"}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block1_reduction_conv", "config": {"activity_regularizer": null, "name": "block1_reduction_conv", "padding": "same", "kernel_constraint": null, "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [2, 2], "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "filters": 64, "data_format": "channels_last"}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"center": true, "name": "batch_normalization_1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "beta_constraint": null}, "inbound_nodes": [[["block1_reduction_conv", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"noise_shape": null, "name": "dropout_1", "trainable": true, "rate": 0.5, "seed": null}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_conv1", "config": {"activity_regularizer": null, "name": "block2_conv1", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "filters": 128, "data_format": "channels_last"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_conv2", "config": {"activity_regularizer": null, "name": "block2_conv2", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "filters": 128, "data_format": "channels_last"}, "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block2_reduction_conv", "config": {"activity_regularizer": null, "name": "block2_reduction_conv", "padding": "same", "kernel_constraint": null, "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [2, 2], "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "filters": 128, "data_format": "channels_last"}, "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"center": true, "name": "batch_normalization_2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "beta_constraint": null}, "inbound_nodes": [[["block2_reduction_conv", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_2", "config": {"noise_shape": null, "name": "dropout_2", "trainable": true, "rate": 0.5, "seed": null}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv1", "config": {"activity_regularizer": null, "name": "block3_conv1", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "filters": 256, "data_format": "channels_last"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv2", "config": {"activity_regularizer": null, "name": "block3_conv2", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "filters": 256, "data_format": "channels_last"}, "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_conv3", "config": {"activity_regularizer": null, "name": "block3_conv3", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "filters": 256, "data_format": "channels_last"}, "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block3_reduction_conv", "config": {"activity_regularizer": null, "name": "block3_reduction_conv", "padding": "same", "kernel_constraint": null, "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [2, 2], "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "filters": 256, "data_format": "channels_last"}, "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"center": true, "name": "batch_normalization_3", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "beta_constraint": null}, "inbound_nodes": [[["block3_reduction_conv", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_3", "config": {"noise_shape": null, "name": "dropout_3", "trainable": true, "rate": 0.5, "seed": null}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv1", "config": {"activity_regularizer": null, "name": "block4_conv1", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "filters": 512, "data_format": "channels_last"}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv2", "config": {"activity_regularizer": null, "name": "block4_conv2", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "filters": 512, "data_format": "channels_last"}, "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_conv3", "config": {"activity_regularizer": null, "name": "block4_conv3", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "filters": 512, "data_format": "channels_last"}, "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block4_reduction_conv", "config": {"activity_regularizer": null, "name": "block4_reduction_conv", "padding": "same", "kernel_constraint": null, "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [2, 2], "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "filters": 512, "data_format": "channels_last"}, "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"center": true, "name": "batch_normalization_4", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "beta_constraint": null}, "inbound_nodes": [[["block4_reduction_conv", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_4", "config": {"noise_shape": null, "name": "dropout_4", "trainable": true, "rate": 0.5, "seed": null}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv1", "config": {"activity_regularizer": null, "name": "block5_conv1", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "filters": 512, "data_format": "channels_last"}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv2", "config": {"activity_regularizer": null, "name": "block5_conv2", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "filters": 512, "data_format": "channels_last"}, "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_conv3", "config": {"activity_regularizer": null, "name": "block5_conv3", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "filters": 512, "data_format": "channels_last"}, "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "block5_reduction_conv", "config": {"activity_regularizer": null, "name": "block5_reduction_conv", "padding": "same", "kernel_constraint": null, "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [2, 2], "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "filters": 512, "data_format": "channels_last"}, "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}], "output_layers": [["block5_reduction_conv", 0, 0]]}, "inbound_nodes": [[["image_input", 0, 0, {}]]]}, {"class_name": "Model", "name": "textModel", "config": {"name": "textModel", "input_layers": [["words_input", 0, 0], ["padding_masks", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "words_input", "config": {"name": "words_input", "batch_input_shape": [null, 60], "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "Embedding", "name": "w2v_emb", "config": {"activity_regularizer": null, "name": "w2v_emb", "input_length": null, "mask_zero": false, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "dtype": "float32", "batch_input_shape": [null, null], "trainable": false, "embeddings_constraint": null, "embeddings_regularizer": null, "input_dim": 1943, "output_dim": 300}, "inbound_nodes": [[["words_input", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_1", "config": {"activity_regularizer": null, "name": "conv1d_1", "padding": "same", "kernel_constraint": null, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [3], "dilation_rate": [1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "filters": 324, "data_format": "channels_last"}, "inbound_nodes": [[["w2v_emb", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_3", "config": {"activity_regularizer": null, "name": "conv1d_3", "padding": "same", "kernel_constraint": null, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [5], "dilation_rate": [1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "filters": 324, "data_format": "channels_last"}, "inbound_nodes": [[["w2v_emb", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_5", "config": {"activity_regularizer": null, "name": "conv1d_5", "padding": "same", "kernel_constraint": null, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [7], "dilation_rate": [1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "filters": 324, "data_format": "channels_last"}, "inbound_nodes": [[["w2v_emb", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_7", "config": {"activity_regularizer": null, "name": "conv1d_7", "padding": "same", "kernel_constraint": null, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [3], "dilation_rate": [2], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "filters": 324, "data_format": "channels_last"}, "inbound_nodes": [[["w2v_emb", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_9", "config": {"activity_regularizer": null, "name": "conv1d_9", "padding": "same", "kernel_constraint": null, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [5], "dilation_rate": [2], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "filters": 324, "data_format": "channels_last"}, "inbound_nodes": [[["w2v_emb", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_11", "config": {"activity_regularizer": null, "name": "conv1d_11", "padding": "same", "kernel_constraint": null, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [7], "dilation_rate": [2], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "filters": 324, "data_format": "channels_last"}, "inbound_nodes": [[["w2v_emb", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_1", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_2", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["conv1d_3", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_3", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["conv1d_5", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_4", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["conv1d_7", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_5", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["conv1d_9", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_6", "config": {"name": "elu_6", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["conv1d_11", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_2", "config": {"activity_regularizer": null, "name": "conv1d_2", "padding": "same", "kernel_constraint": null, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [3], "dilation_rate": [1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "filters": 324, "data_format": "channels_last"}, "inbound_nodes": [[["elu_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_4", "config": {"activity_regularizer": null, "name": "conv1d_4", "padding": "same", "kernel_constraint": null, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [5], "dilation_rate": [1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "filters": 324, "data_format": "channels_last"}, "inbound_nodes": [[["elu_2", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_6", "config": {"activity_regularizer": null, "name": "conv1d_6", "padding": "same", "kernel_constraint": null, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [7], "dilation_rate": [1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "filters": 324, "data_format": "channels_last"}, "inbound_nodes": [[["elu_3", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_8", "config": {"activity_regularizer": null, "name": "conv1d_8", "padding": "same", "kernel_constraint": null, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [3], "dilation_rate": [2], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "filters": 324, "data_format": "channels_last"}, "inbound_nodes": [[["elu_4", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_10", "config": {"activity_regularizer": null, "name": "conv1d_10", "padding": "same", "kernel_constraint": null, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [5], "dilation_rate": [2], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "filters": 324, "data_format": "channels_last"}, "inbound_nodes": [[["elu_5", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_12", "config": {"activity_regularizer": null, "name": "conv1d_12", "padding": "same", "kernel_constraint": null, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [7], "dilation_rate": [2], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "filters": 324, "data_format": "channels_last"}, "inbound_nodes": [[["elu_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"center": true, "name": "batch_normalization_5", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "beta_constraint": null}, "inbound_nodes": [[["conv1d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"center": true, "name": "batch_normalization_6", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "beta_constraint": null}, "inbound_nodes": [[["conv1d_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"center": true, "name": "batch_normalization_7", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "beta_constraint": null}, "inbound_nodes": [[["conv1d_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"center": true, "name": "batch_normalization_8", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "beta_constraint": null}, "inbound_nodes": [[["conv1d_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"center": true, "name": "batch_normalization_9", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "beta_constraint": null}, "inbound_nodes": [[["conv1d_10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"center": true, "name": "batch_normalization_10", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "beta_constraint": null}, "inbound_nodes": [[["conv1d_12", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_1", "config": {"name": "concatenate_1", "axis": -1, "trainable": true}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}], ["batch_normalization_6", 0, 0, {}], ["batch_normalization_7", 0, 0, {}], ["batch_normalization_8", 0, 0, {}], ["batch_normalization_9", 0, 0, {}], ["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_13", "config": {"activity_regularizer": null, "name": "conv1d_13", "padding": "same", "kernel_constraint": null, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [1], "dilation_rate": [1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "filters": 512, "data_format": "channels_last"}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_7", "config": {"name": "elu_7", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["conv1d_13", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_14", "config": {"activity_regularizer": null, "name": "conv1d_14", "padding": "same", "kernel_constraint": null, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [1], "dilation_rate": [1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "filters": 512, "data_format": "channels_last"}, "inbound_nodes": [[["elu_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"center": true, "name": "batch_normalization_11", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "beta_constraint": null}, "inbound_nodes": [[["conv1d_14", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_5", "config": {"noise_shape": null, "name": "dropout_5", "trainable": true, "rate": 0.5, "seed": null}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "InputLayer", "name": "padding_masks", "config": {"name": "padding_masks", "batch_input_shape": [null, 60, 1], "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "SelfAttention", "name": "sa_2_1", "config": {"name": "sa_2_1", "trainable": true}, "inbound_nodes": [[["dropout_5", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "name": "sa_2_2", "config": {"name": "sa_2_2", "trainable": true}, "inbound_nodes": [[["dropout_5", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "name": "sa_2_3", "config": {"name": "sa_2_3", "trainable": true}, "inbound_nodes": [[["dropout_5", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "name": "sa_2_4", "config": {"name": "sa_2_4", "trainable": true}, "inbound_nodes": [[["dropout_5", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concat_sa_2", "config": {"name": "concat_sa_2", "axis": -1, "trainable": true}, "inbound_nodes": [[["sa_2_1", 0, 0, {}], ["sa_2_2", 0, 0, {}], ["sa_2_3", 0, 0, {}], ["sa_2_4", 0, 0, {}]]]}, {"class_name": "CondenseAttention1D", "name": "condense_attention1d_1", "config": {"name": "condense_attention1d_1", "trainable": true}, "inbound_nodes": [[["concat_sa_2", 0, 0, {}]]]}, {"class_name": "ResidualCombine", "name": "residual_combine_1", "config": {"name": "residual_combine_1", "trainable": true}, "inbound_nodes": [[["dropout_5", 0, 0, {}], ["condense_attention1d_1", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_8", "config": {"name": "elu_8", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["residual_combine_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_15", "config": {"activity_regularizer": null, "name": "conv1d_15", "padding": "same", "kernel_constraint": null, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [1], "dilation_rate": [1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "filters": 512, "data_format": "channels_last"}, "inbound_nodes": [[["elu_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"center": true, "name": "batch_normalization_12", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "beta_constraint": null}, "inbound_nodes": [[["conv1d_15", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_6", "config": {"noise_shape": null, "name": "dropout_6", "trainable": true, "rate": 0.5, "seed": null}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "SelfAttention", "name": "sa_3_1", "config": {"name": "sa_3_1", "trainable": true}, "inbound_nodes": [[["dropout_6", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "name": "sa_3_2", "config": {"name": "sa_3_2", "trainable": true}, "inbound_nodes": [[["dropout_6", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "name": "sa_3_3", "config": {"name": "sa_3_3", "trainable": true}, "inbound_nodes": [[["dropout_6", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "name": "sa_3_4", "config": {"name": "sa_3_4", "trainable": true}, "inbound_nodes": [[["dropout_6", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concat_sa_3", "config": {"name": "concat_sa_3", "axis": -1, "trainable": true}, "inbound_nodes": [[["sa_3_1", 0, 0, {}], ["sa_3_2", 0, 0, {}], ["sa_3_3", 0, 0, {}], ["sa_3_4", 0, 0, {}]]]}, {"class_name": "CondenseAttention1D", "name": "condense_attention1d_2", "config": {"name": "condense_attention1d_2", "trainable": true}, "inbound_nodes": [[["concat_sa_3", 0, 0, {}]]]}, {"class_name": "ResidualCombine", "name": "residual_combine_2", "config": {"name": "residual_combine_2", "trainable": true}, "inbound_nodes": [[["dropout_6", 0, 0, {}], ["condense_attention1d_2", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_9", "config": {"name": "elu_9", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["residual_combine_2", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_16", "config": {"activity_regularizer": null, "name": "conv1d_16", "padding": "same", "kernel_constraint": null, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [1], "dilation_rate": [1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "filters": 512, "data_format": "channels_last"}, "inbound_nodes": [[["elu_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "config": {"center": true, "name": "batch_normalization_13", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "trainable": true, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "beta_constraint": null}, "inbound_nodes": [[["conv1d_16", 0, 0, {}]]]}], "output_layers": [["batch_normalization_13", 0, 0]]}, "inbound_nodes": [[["words_input", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_7", "config": {"noise_shape": null, "name": "dropout_7", "trainable": true, "rate": 0.75, "seed": null}, "inbound_nodes": [[["imgModel", 1, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_8", "config": {"noise_shape": null, "name": "dropout_8", "trainable": true, "rate": 0.75, "seed": null}, "inbound_nodes": [[["textModel", 1, 0, {}]]]}, {"class_name": "Img2TextCA", "name": "img2text_1", "config": {"name": "img2text_1", "trainable": true}, "inbound_nodes": [[["dropout_7", 0, 0, {}], ["dropout_8", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "Img2TextCA", "name": "img2text_2", "config": {"name": "img2text_2", "trainable": true}, "inbound_nodes": [[["dropout_7", 0, 0, {}], ["dropout_8", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "Img2TextCA", "name": "img2text_3", "config": {"name": "img2text_3", "trainable": true}, "inbound_nodes": [[["dropout_7", 0, 0, {}], ["dropout_8", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "Img2TextCA", "name": "img2text_4", "config": {"name": "img2text_4", "trainable": true}, "inbound_nodes": [[["dropout_7", 0, 0, {}], ["dropout_8", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "Text2ImgCA", "name": "text2img_1", "config": {"name": "text2img_1", "trainable": true}, "inbound_nodes": [[["dropout_8", 0, 0, {}], ["dropout_7", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "Text2ImgCA", "name": "text2img_2", "config": {"name": "text2img_2", "trainable": true}, "inbound_nodes": [[["dropout_8", 0, 0, {}], ["dropout_7", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "Text2ImgCA", "name": "text2img_3", "config": {"name": "text2img_3", "trainable": true}, "inbound_nodes": [[["dropout_8", 0, 0, {}], ["dropout_7", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "Text2ImgCA", "name": "text2img_4", "config": {"name": "text2img_4", "trainable": true}, "inbound_nodes": [[["dropout_8", 0, 0, {}], ["dropout_7", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "img2text_concat", "config": {"name": "img2text_concat", "axis": -1, "trainable": true}, "inbound_nodes": [[["img2text_1", 0, 0, {}], ["img2text_2", 0, 0, {}], ["img2text_3", 0, 0, {}], ["img2text_4", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "text2img_concat", "config": {"name": "text2img_concat", "axis": -1, "trainable": true}, "inbound_nodes": [[["text2img_1", 0, 0, {}], ["text2img_2", 0, 0, {}], ["text2img_3", 0, 0, {}], ["text2img_4", 0, 0, {}]]]}, {"class_name": "CondenseAttention2D", "name": "condense_attention2d_1", "config": {"name": "condense_attention2d_1", "trainable": true}, "inbound_nodes": [[["img2text_concat", 0, 0, {}]]]}, {"class_name": "CondenseAttention1D", "name": "condense_attention1d_3", "config": {"name": "condense_attention1d_3", "trainable": true}, "inbound_nodes": [[["text2img_concat", 0, 0, {}]]]}, {"class_name": "ResidualCombine", "name": "residual_combine_3", "config": {"name": "residual_combine_3", "trainable": true}, "inbound_nodes": [[["dropout_7", 0, 0, {}], ["condense_attention2d_1", 0, 0, {}]]]}, {"class_name": "ResidualCombine", "name": "residual_combine_4", "config": {"name": "residual_combine_4", "trainable": true}, "inbound_nodes": [[["dropout_8", 0, 0, {}], ["condense_attention1d_3", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_10", "config": {"name": "elu_10", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["residual_combine_3", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_11", "config": {"name": "elu_11", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["residual_combine_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"activity_regularizer": null, "name": "conv2d_1", "padding": "same", "kernel_constraint": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "filters": 512, "data_format": "channels_last"}, "inbound_nodes": [[["elu_10", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_17", "config": {"activity_regularizer": null, "name": "conv1d_17", "padding": "same", "kernel_constraint": null, "strides": [1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_size": [1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dilation_rate": [1], "trainable": true, "use_bias": true, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "filters": 512, "data_format": "channels_last"}, "inbound_nodes": [[["elu_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "config": {"center": true, "name": "batch_normalization_14", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "trainable": true, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "beta_constraint": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_15", "config": {"center": true, "name": "batch_normalization_15", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "scale": true, "trainable": true, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "beta_constraint": null}, "inbound_nodes": [[["conv1d_17", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_9", "config": {"noise_shape": null, "name": "dropout_9", "trainable": true, "rate": 0.75, "seed": null}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_10", "config": {"noise_shape": null, "name": "dropout_10", "trainable": true, "rate": 0.75, "seed": null}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "name": "img2text_global_pool", "config": {"name": "img2text_global_pool", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["dropout_9", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling1D", "name": "text2img_global_pool", "config": {"name": "text2img_global_pool", "trainable": true}, "inbound_nodes": [[["dropout_10", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "concatenate_8", "config": {"name": "concatenate_8", "axis": -1, "trainable": true}, "inbound_nodes": [[["img2text_global_pool", 0, 0, {}], ["text2img_global_pool", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"activity_regularizer": null, "name": "dense_1", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "activation": "linear", "kernel_regularizer": null, "units": 1024}, "inbound_nodes": [[["concatenate_8", 0, 0, {}]]]}, {"class_name": "ELU", "name": "elu_12", "config": {"name": "elu_12", "alpha": 1.0, "trainable": true}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"activity_regularizer": null, "name": "dense_2", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "activation": "linear", "kernel_regularizer": null, "units": 512}, "inbound_nodes": [[["elu_12", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_11", "config": {"noise_shape": null, "name": "dropout_11", "trainable": true, "rate": 0.75, "seed": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "name": "target_word", "config": {"activity_regularizer": null, "name": "target_word", "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "activation": "softmax", "kernel_regularizer": null, "units": 1943}, "inbound_nodes": [[["dropout_11", 0, 0, {}]]]}], "output_layers": [["target_word", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.2.2"}