{"keras_version": "2.2.2", "class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "image_input", "config": {"batch_input_shape": [null, 256, 256, 3], "sparse": false, "name": "image_input", "dtype": "float32"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "words_input", "config": {"batch_input_shape": [null, 60], "sparse": false, "name": "words_input", "dtype": "float32"}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "padding_masks", "config": {"batch_input_shape": [null, 60, 1], "sparse": false, "name": "padding_masks", "dtype": "float32"}}, {"inbound_nodes": [[["image_input", 0, 0, {}]]], "class_name": "Model", "name": "imgModel", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "image_input", "config": {"dtype": "float32", "sparse": false, "name": "image_input", "batch_input_shape": [null, 256, 256, 3]}}, {"inbound_nodes": [[["image_input", 0, 0, {}]]], "class_name": "Conv2D", "name": "block1_conv1", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 64, "name": "block1_conv1", "activation": "relu"}}, {"inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block1_conv2", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 64, "name": "block1_conv2", "activation": "relu"}}, {"inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block1_reduction_conv", "config": {"kernel_size": [2, 2], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [2, 2], "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 64, "name": "block1_reduction_conv", "activation": "relu"}}, {"inbound_nodes": [[["block1_reduction_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "axis": -1, "center": true, "name": "batch_normalization_1"}}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_1", "config": {"seed": null, "trainable": true, "name": "dropout_1", "rate": 0.5, "noise_shape": null}}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block2_conv1", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 128, "name": "block2_conv1", "activation": "relu"}}, {"inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block2_conv2", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 128, "name": "block2_conv2", "activation": "relu"}}, {"inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block2_reduction_conv", "config": {"kernel_size": [2, 2], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [2, 2], "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 128, "name": "block2_reduction_conv", "activation": "relu"}}, {"inbound_nodes": [[["block2_reduction_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "axis": -1, "center": true, "name": "batch_normalization_2"}}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_2", "config": {"seed": null, "trainable": true, "name": "dropout_2", "rate": 0.5, "noise_shape": null}}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block3_conv1", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 256, "name": "block3_conv1", "activation": "relu"}}, {"inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block3_conv2", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 256, "name": "block3_conv2", "activation": "relu"}}, {"inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block3_conv3", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 256, "name": "block3_conv3", "activation": "relu"}}, {"inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "class_name": "Conv2D", "name": "block3_reduction_conv", "config": {"kernel_size": [2, 2], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [2, 2], "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 256, "name": "block3_reduction_conv", "activation": "relu"}}, {"inbound_nodes": [[["block3_reduction_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "axis": -1, "center": true, "name": "batch_normalization_3"}}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_3", "config": {"seed": null, "trainable": true, "name": "dropout_3", "rate": 0.5, "noise_shape": null}}, {"inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "block4_conv1", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 512, "name": "block4_conv1", "activation": "relu"}}, {"inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block4_conv2", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 512, "name": "block4_conv2", "activation": "relu"}}, {"inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block4_conv3", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 512, "name": "block4_conv3", "activation": "relu"}}, {"inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "class_name": "Conv2D", "name": "block4_reduction_conv", "config": {"kernel_size": [2, 2], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [2, 2], "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 512, "name": "block4_reduction_conv", "activation": "relu"}}, {"inbound_nodes": [[["block4_reduction_conv", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "axis": -1, "center": true, "name": "batch_normalization_4"}}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_4", "config": {"seed": null, "trainable": true, "name": "dropout_4", "rate": 0.5, "noise_shape": null}}, {"inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "block5_conv1", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 512, "name": "block5_conv1", "activation": "relu"}}, {"inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block5_conv2", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 512, "name": "block5_conv2", "activation": "relu"}}, {"inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block5_conv3", "config": {"kernel_size": [3, 3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [1, 1], "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 512, "name": "block5_conv3", "activation": "relu"}}, {"inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "class_name": "Conv2D", "name": "block5_reduction_conv", "config": {"kernel_size": [2, 2], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [2, 2], "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 512, "name": "block5_reduction_conv", "activation": "relu"}}], "name": "imgModel", "output_layers": [["block5_reduction_conv", 0, 0]], "input_layers": [["image_input", 0, 0]]}}, {"inbound_nodes": [[["words_input", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "class_name": "Model", "name": "textModel", "config": {"layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "words_input", "config": {"dtype": "float32", "sparse": false, "name": "words_input", "batch_input_shape": [null, 60]}}, {"inbound_nodes": [[["words_input", 0, 0, {}]]], "class_name": "Embedding", "name": "w2v_emb", "config": {"mask_zero": false, "activity_regularizer": null, "dtype": "float32", "embeddings_regularizer": null, "trainable": false, "input_dim": 1943, "input_length": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"seed": null, "maxval": 0.05, "minval": -0.05}}, "embeddings_constraint": null, "name": "w2v_emb", "output_dim": 300, "batch_input_shape": [null, null]}}, {"inbound_nodes": [[["w2v_emb", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_1", "config": {"kernel_size": [3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [1], "bias_constraint": null, "dilation_rate": [1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 324, "name": "conv1d_1", "activation": "linear"}}, {"inbound_nodes": [[["w2v_emb", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_2", "config": {"kernel_size": [5], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [1], "bias_constraint": null, "dilation_rate": [1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 324, "name": "conv1d_2", "activation": "linear"}}, {"inbound_nodes": [[["w2v_emb", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_3", "config": {"kernel_size": [7], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [1], "bias_constraint": null, "dilation_rate": [1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 324, "name": "conv1d_3", "activation": "linear"}}, {"inbound_nodes": [[["w2v_emb", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_4", "config": {"kernel_size": [3], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [1], "bias_constraint": null, "dilation_rate": [2], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 324, "name": "conv1d_4", "activation": "linear"}}, {"inbound_nodes": [[["w2v_emb", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_5", "config": {"kernel_size": [5], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [1], "bias_constraint": null, "dilation_rate": [2], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 324, "name": "conv1d_5", "activation": "linear"}}, {"inbound_nodes": [[["w2v_emb", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_6", "config": {"kernel_size": [7], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [1], "bias_constraint": null, "dilation_rate": [2], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 324, "name": "conv1d_6", "activation": "linear"}}, {"inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "class_name": "ELU", "name": "elu_1", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "class_name": "ELU", "name": "elu_2", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"inbound_nodes": [[["conv1d_3", 0, 0, {}]]], "class_name": "ELU", "name": "elu_3", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"inbound_nodes": [[["conv1d_4", 0, 0, {}]]], "class_name": "ELU", "name": "elu_4", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"inbound_nodes": [[["conv1d_5", 0, 0, {}]]], "class_name": "ELU", "name": "elu_5", "config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}}, {"inbound_nodes": [[["conv1d_6", 0, 0, {}]]], "class_name": "ELU", "name": "elu_6", "config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}}, {"inbound_nodes": [[["elu_1", 0, 0, {}], ["elu_2", 0, 0, {}], ["elu_3", 0, 0, {}], ["elu_4", 0, 0, {}], ["elu_5", 0, 0, {}], ["elu_6", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_1", "config": {"trainable": true, "axis": -1, "name": "concatenate_1"}}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_7", "config": {"kernel_size": [1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [1], "bias_constraint": null, "dilation_rate": [1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 512, "name": "conv1d_7", "activation": "linear"}}, {"inbound_nodes": [[["conv1d_7", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "axis": -1, "center": true, "name": "batch_normalization_5"}}, {"inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "ELU", "name": "elu_7", "config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}}, {"inbound_nodes": [[["elu_7", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_5", "config": {"seed": null, "trainable": true, "name": "dropout_5", "rate": 0.5, "noise_shape": null}}, {"inbound_nodes": [], "class_name": "InputLayer", "name": "padding_masks", "config": {"dtype": "float32", "sparse": false, "name": "padding_masks", "batch_input_shape": [null, 60, 1]}}, {"inbound_nodes": [[["dropout_5", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "class_name": "SelfAttention", "name": "sa_2_1", "config": {"trainable": true, "name": "sa_2_1"}}, {"inbound_nodes": [[["dropout_5", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "class_name": "SelfAttention", "name": "sa_2_2", "config": {"trainable": true, "name": "sa_2_2"}}, {"inbound_nodes": [[["dropout_5", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "class_name": "SelfAttention", "name": "sa_2_3", "config": {"trainable": true, "name": "sa_2_3"}}, {"inbound_nodes": [[["dropout_5", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "class_name": "SelfAttention", "name": "sa_2_4", "config": {"trainable": true, "name": "sa_2_4"}}, {"inbound_nodes": [[["sa_2_1", 0, 0, {}], ["sa_2_2", 0, 0, {}], ["sa_2_3", 0, 0, {}], ["sa_2_4", 0, 0, {}]]], "class_name": "Concatenate", "name": "concat_sa_2", "config": {"trainable": true, "axis": -1, "name": "concat_sa_2"}}, {"inbound_nodes": [[["dropout_5", 0, 0, {}], ["concat_sa_2", 0, 0, {}]]], "class_name": "ResidualCombine1D", "name": "residual_combine1d_1", "config": {"trainable": true, "name": "residual_combine1d_1"}}, {"inbound_nodes": [[["residual_combine1d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "axis": -1, "center": true, "name": "batch_normalization_6"}}, {"inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_8", "config": {"kernel_size": [1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [1], "bias_constraint": null, "dilation_rate": [1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 512, "name": "conv1d_8", "activation": "linear"}}, {"inbound_nodes": [[["conv1d_8", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "axis": -1, "center": true, "name": "batch_normalization_7"}}, {"inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "ELU", "name": "elu_25", "config": {"alpha": 1.0, "trainable": true, "name": "elu_25"}}, {"inbound_nodes": [[["elu_25", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_6", "config": {"seed": null, "trainable": true, "name": "dropout_6", "rate": 0.5, "noise_shape": null}}, {"inbound_nodes": [[["dropout_6", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "class_name": "SelfAttention", "name": "sa_3_1", "config": {"trainable": true, "name": "sa_3_1"}}, {"inbound_nodes": [[["dropout_6", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "class_name": "SelfAttention", "name": "sa_3_2", "config": {"trainable": true, "name": "sa_3_2"}}, {"inbound_nodes": [[["dropout_6", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "class_name": "SelfAttention", "name": "sa_3_3", "config": {"trainable": true, "name": "sa_3_3"}}, {"inbound_nodes": [[["dropout_6", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "class_name": "SelfAttention", "name": "sa_3_4", "config": {"trainable": true, "name": "sa_3_4"}}, {"inbound_nodes": [[["sa_3_1", 0, 0, {}], ["sa_3_2", 0, 0, {}], ["sa_3_3", 0, 0, {}], ["sa_3_4", 0, 0, {}]]], "class_name": "Concatenate", "name": "concat_sa_3", "config": {"trainable": true, "axis": -1, "name": "concat_sa_3"}}, {"inbound_nodes": [[["dropout_6", 0, 0, {}], ["concat_sa_3", 0, 0, {}]]], "class_name": "ResidualCombine1D", "name": "residual_combine1d_2", "config": {"trainable": true, "name": "residual_combine1d_2"}}, {"inbound_nodes": [[["residual_combine1d_2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "axis": -1, "center": true, "name": "batch_normalization_8"}}, {"inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "Conv1D", "name": "conv1d_9", "config": {"kernel_size": [1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "strides": [1], "bias_constraint": null, "dilation_rate": [1], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "filters": 512, "name": "conv1d_9", "activation": "linear"}}, {"inbound_nodes": [[["conv1d_9", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "axis": -1, "center": true, "name": "batch_normalization_9"}}, {"inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "class_name": "ELU", "name": "elu_43", "config": {"alpha": 1.0, "trainable": true, "name": "elu_43"}}], "name": "textModel", "output_layers": [["elu_43", 0, 0]], "input_layers": [["words_input", 0, 0], ["padding_masks", 0, 0]]}}, {"inbound_nodes": [[["imgModel", 1, 0, {}]]], "class_name": "Dropout", "name": "dropout_7", "config": {"seed": null, "trainable": true, "rate": 0.75, "noise_shape": null, "name": "dropout_7"}}, {"inbound_nodes": [[["textModel", 1, 0, {}]]], "class_name": "Dropout", "name": "dropout_8", "config": {"seed": null, "trainable": true, "rate": 0.75, "noise_shape": null, "name": "dropout_8"}}, {"inbound_nodes": [[["dropout_8", 0, 0, {}], ["dropout_7", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "class_name": "Text2ImgCA", "name": "text2img_1", "config": {"trainable": true, "name": "text2img_1"}}, {"inbound_nodes": [[["dropout_8", 0, 0, {}], ["dropout_7", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "class_name": "Text2ImgCA", "name": "text2img_2", "config": {"trainable": true, "name": "text2img_2"}}, {"inbound_nodes": [[["dropout_8", 0, 0, {}], ["dropout_7", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "class_name": "Text2ImgCA", "name": "text2img_3", "config": {"trainable": true, "name": "text2img_3"}}, {"inbound_nodes": [[["dropout_8", 0, 0, {}], ["dropout_7", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "class_name": "Text2ImgCA", "name": "text2img_4", "config": {"trainable": true, "name": "text2img_4"}}, {"inbound_nodes": [[["dropout_7", 0, 0, {}], ["dropout_8", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "class_name": "Img2TextCA", "name": "img2text_1", "config": {"trainable": true, "name": "img2text_1"}}, {"inbound_nodes": [[["dropout_7", 0, 0, {}], ["dropout_8", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "class_name": "Img2TextCA", "name": "img2text_2", "config": {"trainable": true, "name": "img2text_2"}}, {"inbound_nodes": [[["dropout_7", 0, 0, {}], ["dropout_8", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "class_name": "Img2TextCA", "name": "img2text_3", "config": {"trainable": true, "name": "img2text_3"}}, {"inbound_nodes": [[["dropout_7", 0, 0, {}], ["dropout_8", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "class_name": "Img2TextCA", "name": "img2text_4", "config": {"trainable": true, "name": "img2text_4"}}, {"inbound_nodes": [[["text2img_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_14", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_14", "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "axis": -1, "gamma_regularizer": null, "gamma_constraint": null}}, {"inbound_nodes": [[["text2img_2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_15", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_15", "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "axis": -1, "gamma_regularizer": null, "gamma_constraint": null}}, {"inbound_nodes": [[["text2img_3", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_16", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_16", "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "axis": -1, "gamma_regularizer": null, "gamma_constraint": null}}, {"inbound_nodes": [[["text2img_4", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_17", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_17", "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "axis": -1, "gamma_regularizer": null, "gamma_constraint": null}}, {"inbound_nodes": [[["img2text_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_10", "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "axis": -1, "gamma_regularizer": null, "gamma_constraint": null}}, {"inbound_nodes": [[["img2text_2", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_11", "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "axis": -1, "gamma_regularizer": null, "gamma_constraint": null}}, {"inbound_nodes": [[["img2text_3", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_12", "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "axis": -1, "gamma_regularizer": null, "gamma_constraint": null}}, {"inbound_nodes": [[["img2text_4", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_13", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_13", "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "axis": -1, "gamma_regularizer": null, "gamma_constraint": null}}, {"inbound_nodes": [[["batch_normalization_14", 0, 0, {}], ["batch_normalization_15", 0, 0, {}], ["batch_normalization_16", 0, 0, {}], ["batch_normalization_17", 0, 0, {}]]], "class_name": "Concatenate", "name": "text2img_concat", "config": {"trainable": true, "axis": -1, "name": "text2img_concat"}}, {"inbound_nodes": [[["batch_normalization_10", 0, 0, {}], ["batch_normalization_11", 0, 0, {}], ["batch_normalization_12", 0, 0, {}], ["batch_normalization_13", 0, 0, {}]]], "class_name": "Concatenate", "name": "img2text_concat", "config": {"trainable": true, "axis": -1, "name": "img2text_concat"}}, {"inbound_nodes": [[["text2img_concat", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "batch_normalization_18", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_18", "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "axis": -1, "gamma_regularizer": null, "gamma_constraint": null}}, {"inbound_nodes": [[["dropout_7", 0, 0, {}], ["img2text_concat", 0, 0, {}]]], "class_name": "ResidualCombine2D", "name": "residual_combine2d_1", "config": {"trainable": true, "name": "residual_combine2d_1"}}, {"inbound_nodes": [[["dropout_8", 0, 0, {}], ["batch_normalization_18", 0, 0, {}]]], "class_name": "ResidualCombine1D", "name": "residual_combine1d_3", "config": {"trainable": true, "name": "residual_combine1d_3"}}, {"inbound_nodes": [[["residual_combine2d_1", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "img2text_comb_batchnorm", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "img2text_comb_batchnorm", "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "axis": -1, "gamma_regularizer": null, "gamma_constraint": null}}, {"inbound_nodes": [[["residual_combine1d_3", 0, 0, {}]]], "class_name": "BatchNormalization", "name": "text2img_comb_batchnorm", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "text2img_comb_batchnorm", "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "axis": -1, "gamma_regularizer": null, "gamma_constraint": null}}, {"inbound_nodes": [[["img2text_comb_batchnorm", 0, 0, {}]]], "class_name": "ELU", "name": "elu_95", "config": {"alpha": 1.0, "trainable": true, "name": "elu_95"}}, {"inbound_nodes": [[["text2img_comb_batchnorm", 0, 0, {}]]], "class_name": "ELU", "name": "elu_113", "config": {"alpha": 1.0, "trainable": true, "name": "elu_113"}}, {"inbound_nodes": [[["elu_95", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_9", "config": {"seed": null, "trainable": true, "rate": 0.5, "noise_shape": null, "name": "dropout_9"}}, {"inbound_nodes": [[["elu_113", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_10", "config": {"seed": null, "trainable": true, "rate": 0.75, "noise_shape": null, "name": "dropout_10"}}, {"inbound_nodes": [[["dropout_9", 0, 0, {}]]], "class_name": "GlobalAveragePooling2D", "name": "img2text_global_pool", "config": {"trainable": true, "data_format": "channels_last", "name": "img2text_global_pool"}}, {"inbound_nodes": [[["dropout_10", 0, 0, {}]]], "class_name": "GlobalAveragePooling1D", "name": "text2img_global_pool", "config": {"trainable": true, "name": "text2img_global_pool"}}, {"inbound_nodes": [[["img2text_global_pool", 0, 0, {}], ["text2img_global_pool", 0, 0, {}]]], "class_name": "Concatenate", "name": "concatenate_8", "config": {"trainable": true, "axis": -1, "name": "concatenate_8"}}, {"inbound_nodes": [[["concatenate_8", 0, 0, {}]]], "class_name": "Dense", "name": "dense_1", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "units": 512, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "name": "dense_1"}}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "ELU", "name": "elu_114", "config": {"alpha": 1.0, "trainable": true, "name": "elu_114"}}, {"inbound_nodes": [[["elu_114", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_11", "config": {"seed": null, "trainable": true, "rate": 0.75, "noise_shape": null, "name": "dropout_11"}}, {"inbound_nodes": [[["dropout_11", 0, 0, {}]]], "class_name": "Dense", "name": "target_word", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "units": 1943, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "name": "target_word"}}], "name": "model_1", "output_layers": [["target_word", 0, 0]], "input_layers": [["image_input", 0, 0], ["words_input", 0, 0], ["padding_masks", 0, 0]]}}