{"class_name": "Model", "config": {"output_layers": [["target_word", 0, 0]], "input_layers": [["words_input", 0, 0], ["padding_masks", 0, 0]], "name": "model_11", "layers": [{"class_name": "InputLayer", "name": "words_input", "inbound_nodes": [], "config": {"sparse": false, "name": "words_input", "batch_input_shape": [null, 60], "dtype": "float32"}}, {"class_name": "InputLayer", "name": "padding_masks", "inbound_nodes": [], "config": {"sparse": false, "name": "padding_masks", "batch_input_shape": [null, 60, 1], "dtype": "float32"}}, {"class_name": "Model", "name": "textModel", "inbound_nodes": [[["words_input", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "config": {"output_layers": [["batch_normalization_7", 0, 0]], "input_layers": [["words_input", 0, 0], ["padding_masks", 0, 0]], "name": "textModel", "layers": [{"class_name": "InputLayer", "name": "words_input", "inbound_nodes": [], "config": {"sparse": false, "name": "words_input", "batch_input_shape": [null, 60], "dtype": "float32"}}, {"class_name": "Embedding", "name": "w2v_emb", "inbound_nodes": [[["words_input", 0, 0, {}]]], "config": {"embeddings_regularizer": null, "trainable": false, "input_dim": 20795, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"maxval": 0.05, "seed": null, "minval": -0.05}}, "name": "w2v_emb", "batch_input_shape": [null, null], "dtype": "float32", "input_length": null, "mask_zero": false, "activity_regularizer": null, "output_dim": 300, "embeddings_constraint": null}}, {"class_name": "InputLayer", "name": "padding_masks", "inbound_nodes": [], "config": {"sparse": false, "name": "padding_masks", "batch_input_shape": [null, 60, 1], "dtype": "float32"}}, {"class_name": "SelfAttention", "name": "sa10", "inbound_nodes": [[["w2v_emb", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "config": {"trainable": true, "name": "sa10"}}, {"class_name": "SelfAttention", "name": "sa11", "inbound_nodes": [[["w2v_emb", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "config": {"trainable": true, "name": "sa11"}}, {"class_name": "SelfAttention", "name": "sa12", "inbound_nodes": [[["w2v_emb", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "config": {"trainable": true, "name": "sa12"}}, {"class_name": "SelfAttention", "name": "sa13", "inbound_nodes": [[["w2v_emb", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "config": {"trainable": true, "name": "sa13"}}, {"class_name": "SelfAttention", "name": "sa14", "inbound_nodes": [[["w2v_emb", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "config": {"trainable": true, "name": "sa14"}}, {"class_name": "SelfAttention", "name": "sa15", "inbound_nodes": [[["w2v_emb", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "config": {"trainable": true, "name": "sa15"}}, {"class_name": "SelfAttention", "name": "sa16", "inbound_nodes": [[["w2v_emb", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "config": {"trainable": true, "name": "sa16"}}, {"class_name": "SelfAttention", "name": "sa17", "inbound_nodes": [[["w2v_emb", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "config": {"trainable": true, "name": "sa17"}}, {"class_name": "Concatenate", "name": "concat_selfattn_1", "inbound_nodes": [[["sa10", 0, 7, {}], ["sa11", 0, 7, {}], ["sa12", 0, 7, {}], ["sa13", 0, 7, {}], ["sa14", 0, 7, {}], ["sa15", 0, 7, {}], ["sa16", 0, 7, {}], ["sa17", 0, 7, {}]]], "config": {"trainable": true, "name": "concat_selfattn_1", "axis": -1}}, {"class_name": "CondenseAttention1D", "name": "condense_selfattn1D_1", "inbound_nodes": [[["concat_selfattn_1", 0, 0, {}]]], "config": {"trainable": true, "name": "condense_selfattn1D_1"}}, {"class_name": "ResidualCombine", "name": "residual_combine_selfattn_1", "inbound_nodes": [[["w2v_emb", 0, 0, {}], ["condense_selfattn1D_1", 0, 0, {}]]], "config": {"trainable": true, "name": "residual_combine_selfattn_1"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "inbound_nodes": [[["residual_combine_selfattn_1", 0, 0, {}]]], "config": {"trainable": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_6", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "scale": true, "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}, {"class_name": "SelfAttention", "name": "sa20", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "config": {"trainable": true, "name": "sa20"}}, {"class_name": "SelfAttention", "name": "sa21", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "config": {"trainable": true, "name": "sa21"}}, {"class_name": "SelfAttention", "name": "sa22", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "config": {"trainable": true, "name": "sa22"}}, {"class_name": "SelfAttention", "name": "sa23", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "config": {"trainable": true, "name": "sa23"}}, {"class_name": "SelfAttention", "name": "sa24", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "config": {"trainable": true, "name": "sa24"}}, {"class_name": "SelfAttention", "name": "sa25", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "config": {"trainable": true, "name": "sa25"}}, {"class_name": "SelfAttention", "name": "sa26", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "config": {"trainable": true, "name": "sa26"}}, {"class_name": "SelfAttention", "name": "sa27", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["padding_masks", 0, 0, {}]]], "config": {"trainable": true, "name": "sa27"}}, {"class_name": "Concatenate", "name": "concat_selfattn_2", "inbound_nodes": [[["sa20", 0, 7, {}], ["sa21", 0, 7, {}], ["sa22", 0, 7, {}], ["sa23", 0, 7, {}], ["sa24", 0, 7, {}], ["sa25", 0, 7, {}], ["sa26", 0, 7, {}], ["sa27", 0, 7, {}]]], "config": {"trainable": true, "name": "concat_selfattn_2", "axis": -1}}, {"class_name": "CondenseAttention1D", "name": "condense_selfattn1D_2", "inbound_nodes": [[["concat_selfattn_2", 0, 0, {}]]], "config": {"trainable": true, "name": "condense_selfattn1D_2"}}, {"class_name": "ResidualCombine", "name": "residual_combine_selfattn_2", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}], ["condense_selfattn1D_2", 0, 0, {}]]], "config": {"trainable": true, "name": "residual_combine_selfattn_2"}}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "inbound_nodes": [[["residual_combine_selfattn_2", 0, 0, {}]]], "config": {"trainable": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "name": "batch_normalization_7", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "gamma_constraint": null, "scale": true, "beta_constraint": null, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99}}]}}, {"class_name": "GlobalAveragePooling1D", "name": "text2img_global_pool", "inbound_nodes": [[["textModel", 1, 0, {}]]], "config": {"trainable": true, "name": "text2img_global_pool"}}, {"class_name": "Dense", "name": "dense_638", "inbound_nodes": [[["text2img_global_pool", 0, 0, {}]]], "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "relu", "name": "dense_638", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 1024, "activity_regularizer": null}}, {"class_name": "Dense", "name": "target_word", "inbound_nodes": [[["dense_638", 0, 0, {}]]], "config": {"trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "softmax", "name": "target_word", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "units": 20795, "activity_regularizer": null}}]}, "backend": "tensorflow", "keras_version": "2.2.2"}