{"backend": "tensorflow", "class_name": "Model", "config": {"input_layers": [["image_input", 0, 0], ["words_input", 0, 0], ["padding_masks", 0, 0]], "output_layers": [["target_word", 0, 0]], "name": "model_1", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "name": "image_input"}, "name": "image_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 60], "dtype": "float32", "sparse": false, "name": "words_input"}, "name": "words_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 60, 1], "dtype": "float32", "sparse": false, "name": "padding_masks"}, "name": "padding_masks", "inbound_nodes": []}, {"class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["block5_pool", 0, 0]], "name": "vgg16", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "block1_conv1", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "use_bias": true, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "filters": 64, "trainable": true}, "name": "block1_conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "block1_conv2", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "use_bias": true, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "filters": 64, "trainable": true}, "name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block1_pool", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "trainable": true}, "name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "block2_conv1", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "use_bias": true, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "filters": 128, "trainable": true}, "name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "block2_conv2", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "use_bias": true, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "filters": 128, "trainable": true}, "name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block2_pool", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "trainable": true}, "name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "block3_conv1", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "use_bias": true, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "filters": 256, "trainable": true}, "name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "block3_conv2", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "use_bias": true, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "filters": 256, "trainable": true}, "name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "block3_conv3", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "use_bias": true, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "filters": 256, "trainable": true}, "name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block3_pool", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "trainable": true}, "name": "block3_pool", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "block4_conv1", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "use_bias": true, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "filters": 512, "trainable": true}, "name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "block4_conv2", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "use_bias": true, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "filters": 512, "trainable": true}, "name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "block4_conv3", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "use_bias": true, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "filters": 512, "trainable": true}, "name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block4_pool", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "trainable": true}, "name": "block4_pool", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "block5_conv1", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "use_bias": true, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "filters": 512, "trainable": true}, "name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "block5_conv2", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "use_bias": true, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "filters": 512, "trainable": true}, "name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "block5_conv3", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [3, 3], "kernel_regularizer": null, "use_bias": true, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "filters": 512, "trainable": true}, "name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "block5_pool", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid", "trainable": true}, "name": "block5_pool", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}]}, "name": "vgg16", "inbound_nodes": [[["image_input", 0, 0, {}]]]}, {"class_name": "Model", "config": {"input_layers": [["words_input", 0, 0], ["padding_masks", 0, 0]], "output_layers": [["text_context", 0, 0]], "name": "textModel", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 60], "dtype": "float32", "sparse": false, "name": "words_input"}, "name": "words_input", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"batch_input_shape": [null, null], "input_dim": 20795, "name": "w2v_emb", "embeddings_regularizer": null, "input_length": null, "embeddings_constraint": null, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "seed": null, "maxval": 0.05}}, "activity_regularizer": null, "mask_zero": false, "dtype": "float32", "output_dim": 300, "trainable": true}, "name": "w2v_emb", "inbound_nodes": [[["words_input", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"bias_regularizer": null, "name": "conv1d_1", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [3], "kernel_regularizer": null, "use_bias": true, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "activity_regularizer": null, "strides": [1], "filters": 300, "trainable": true}, "name": "conv1d_1", "inbound_nodes": [[["w2v_emb", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"bias_regularizer": null, "name": "conv1d_2", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [3], "kernel_regularizer": null, "use_bias": true, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [2], "activity_regularizer": null, "strides": [1], "filters": 300, "trainable": true}, "name": "conv1d_2", "inbound_nodes": [[["w2v_emb", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"bias_regularizer": null, "name": "conv1d_3", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [5], "kernel_regularizer": null, "use_bias": true, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "activity_regularizer": null, "strides": [1], "filters": 300, "trainable": true}, "name": "conv1d_3", "inbound_nodes": [[["w2v_emb", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"bias_regularizer": null, "name": "conv1d_4", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [5], "kernel_regularizer": null, "use_bias": true, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [2], "activity_regularizer": null, "strides": [1], "filters": 300, "trainable": true}, "name": "conv1d_4", "inbound_nodes": [[["w2v_emb", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"bias_regularizer": null, "name": "conv1d_5", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [7], "kernel_regularizer": null, "use_bias": true, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "activity_regularizer": null, "strides": [1], "filters": 300, "trainable": true}, "name": "conv1d_5", "inbound_nodes": [[["w2v_emb", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"bias_regularizer": null, "name": "conv1d_6", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [7], "kernel_regularizer": null, "use_bias": true, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [2], "activity_regularizer": null, "strides": [1], "filters": 300, "trainable": true}, "name": "conv1d_6", "inbound_nodes": [[["w2v_emb", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": -1, "name": "concatenate_1", "trainable": true}, "name": "concatenate_1", "inbound_nodes": [[["conv1d_1", 0, 0, {}], ["conv1d_2", 0, 0, {}], ["conv1d_3", 0, 0, {}], ["conv1d_4", 0, 0, {}], ["conv1d_5", 0, 0, {}], ["conv1d_6", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"bias_regularizer": null, "name": "conv1d_7", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_size": [1], "kernel_regularizer": null, "use_bias": true, "padding": "same", "data_format": "channels_last", "bias_constraint": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1], "activity_regularizer": null, "strides": [1], "filters": 300, "trainable": true}, "name": "conv1d_7", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_1", "inbound_nodes": [[["conv1d_7", 0, 0, {}]]]}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 60, 1], "dtype": "float32", "sparse": false, "name": "padding_masks"}, "name": "padding_masks", "inbound_nodes": []}, {"class_name": "SelfAttention", "config": {"name": "sa10", "trainable": true}, "name": "sa10", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa11", "trainable": true}, "name": "sa11", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa12", "trainable": true}, "name": "sa12", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa13", "trainable": true}, "name": "sa13", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa14", "trainable": true}, "name": "sa14", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa15", "trainable": true}, "name": "sa15", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa16", "trainable": true}, "name": "sa16", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa17", "trainable": true}, "name": "sa17", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_2", "inbound_nodes": [[["sa10", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_3", "inbound_nodes": [[["sa11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_4", "inbound_nodes": [[["sa12", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_5", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_5", "inbound_nodes": [[["sa13", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_6", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_6", "inbound_nodes": [[["sa14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_7", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_7", "inbound_nodes": [[["sa15", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_8", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_8", "inbound_nodes": [[["sa16", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_9", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_9", "inbound_nodes": [[["sa17", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": -1, "name": "concat_selfattn_1", "trainable": true}, "name": "concat_selfattn_1", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}], ["batch_normalization_3", 0, 0, {}], ["batch_normalization_4", 0, 0, {}], ["batch_normalization_5", 0, 0, {}], ["batch_normalization_6", 0, 0, {}], ["batch_normalization_7", 0, 0, {}], ["batch_normalization_8", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "CondenseAttention1D", "config": {"name": "condense_selfattn1D_1", "trainable": true}, "name": "condense_selfattn1D_1", "inbound_nodes": [[["concat_selfattn_1", 0, 0, {}]]]}, {"class_name": "ResidualCombine", "config": {"name": "residual_combine_selfattn_1", "trainable": true}, "name": "residual_combine_selfattn_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}], ["condense_selfattn1D_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_10", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_10", "inbound_nodes": [[["residual_combine_selfattn_1", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa20", "trainable": true}, "name": "sa20", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa21", "trainable": true}, "name": "sa21", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa22", "trainable": true}, "name": "sa22", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa23", "trainable": true}, "name": "sa23", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa24", "trainable": true}, "name": "sa24", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa25", "trainable": true}, "name": "sa25", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa26", "trainable": true}, "name": "sa26", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa27", "trainable": true}, "name": "sa27", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_11", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_11", "inbound_nodes": [[["sa20", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_12", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_12", "inbound_nodes": [[["sa21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_13", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_13", "inbound_nodes": [[["sa22", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_14", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_14", "inbound_nodes": [[["sa23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_15", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_15", "inbound_nodes": [[["sa24", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_16", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_16", "inbound_nodes": [[["sa25", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_17", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_17", "inbound_nodes": [[["sa26", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_18", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_18", "inbound_nodes": [[["sa27", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": -1, "name": "concat_selfattn_2", "trainable": true}, "name": "concat_selfattn_2", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}], ["batch_normalization_12", 0, 0, {}], ["batch_normalization_13", 0, 0, {}], ["batch_normalization_14", 0, 0, {}], ["batch_normalization_15", 0, 0, {}], ["batch_normalization_16", 0, 0, {}], ["batch_normalization_17", 0, 0, {}], ["batch_normalization_18", 0, 0, {}]]]}, {"class_name": "CondenseAttention1D", "config": {"name": "condense_selfattn1D_2", "trainable": true}, "name": "condense_selfattn1D_2", "inbound_nodes": [[["concat_selfattn_2", 0, 0, {}]]]}, {"class_name": "ResidualCombine", "config": {"name": "residual_combine_selfattn_2", "trainable": true}, "name": "residual_combine_selfattn_2", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}], ["condense_selfattn1D_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_19", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_19", "inbound_nodes": [[["residual_combine_selfattn_2", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa30", "trainable": true}, "name": "sa30", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa31", "trainable": true}, "name": "sa31", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa32", "trainable": true}, "name": "sa32", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa33", "trainable": true}, "name": "sa33", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa34", "trainable": true}, "name": "sa34", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa35", "trainable": true}, "name": "sa35", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa36", "trainable": true}, "name": "sa36", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa37", "trainable": true}, "name": "sa37", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_20", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_20", "inbound_nodes": [[["sa30", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_21", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_21", "inbound_nodes": [[["sa31", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_22", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_22", "inbound_nodes": [[["sa32", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_23", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_23", "inbound_nodes": [[["sa33", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_24", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_24", "inbound_nodes": [[["sa34", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_25", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_25", "inbound_nodes": [[["sa35", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_26", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_26", "inbound_nodes": [[["sa36", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_27", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_27", "inbound_nodes": [[["sa37", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": -1, "name": "concat_selfattn_3", "trainable": true}, "name": "concat_selfattn_3", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}], ["batch_normalization_21", 0, 0, {}], ["batch_normalization_22", 0, 0, {}], ["batch_normalization_23", 0, 0, {}], ["batch_normalization_24", 0, 0, {}], ["batch_normalization_25", 0, 0, {}], ["batch_normalization_26", 0, 0, {}], ["batch_normalization_27", 0, 0, {}]]]}, {"class_name": "CondenseAttention1D", "config": {"name": "condense_selfattn1D_3", "trainable": true}, "name": "condense_selfattn1D_3", "inbound_nodes": [[["concat_selfattn_3", 0, 0, {}]]]}, {"class_name": "ResidualCombine", "config": {"name": "residual_combine_selfattn_3", "trainable": true}, "name": "residual_combine_selfattn_3", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}], ["condense_selfattn1D_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_28", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_28", "inbound_nodes": [[["residual_combine_selfattn_3", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa40", "trainable": true}, "name": "sa40", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa41", "trainable": true}, "name": "sa41", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa42", "trainable": true}, "name": "sa42", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa43", "trainable": true}, "name": "sa43", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa44", "trainable": true}, "name": "sa44", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa45", "trainable": true}, "name": "sa45", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa46", "trainable": true}, "name": "sa46", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "SelfAttention", "config": {"name": "sa47", "trainable": true}, "name": "sa47", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_29", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_29", "inbound_nodes": [[["sa40", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_30", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_30", "inbound_nodes": [[["sa41", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_31", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_31", "inbound_nodes": [[["sa42", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_32", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_32", "inbound_nodes": [[["sa43", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_33", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_33", "inbound_nodes": [[["sa44", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_34", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_34", "inbound_nodes": [[["sa45", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_35", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_35", "inbound_nodes": [[["sa46", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_36", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_36", "inbound_nodes": [[["sa47", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"axis": -1, "name": "concat_selfattn_4", "trainable": true}, "name": "concat_selfattn_4", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}], ["batch_normalization_30", 0, 0, {}], ["batch_normalization_31", 0, 0, {}], ["batch_normalization_32", 0, 0, {}], ["batch_normalization_33", 0, 0, {}], ["batch_normalization_34", 0, 0, {}], ["batch_normalization_35", 0, 0, {}], ["batch_normalization_36", 0, 0, {}]]]}, {"class_name": "CondenseAttention1D", "config": {"name": "condense_selfattn1D_4", "trainable": true}, "name": "condense_selfattn1D_4", "inbound_nodes": [[["concat_selfattn_4", 0, 0, {}]]]}, {"class_name": "ResidualCombine", "config": {"name": "residual_combine_selfattn_4", "trainable": true}, "name": "residual_combine_selfattn_4", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}], ["condense_selfattn1D_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_37", "beta_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "epsilon": 0.001, "trainable": true}, "name": "batch_normalization_37", "inbound_nodes": [[["residual_combine_selfattn_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"trainable": true, "bias_regularizer": null, "name": "text_context", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_constraint": null, "kernel_regularizer": null, "units": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "activity_regularizer": null, "use_bias": true}, "name": "text_context", "inbound_nodes": [[["batch_normalization_37", 0, 0, {}]]]}]}, "name": "textModel", "inbound_nodes": [[["words_input", 0, 0, {}], ["padding_masks", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"seed": null, "noise_shape": null, "trainable": true, "name": "dropout_1", "rate": 0.3}, "name": "dropout_1", "inbound_nodes": [[["vgg16", 1, 0, {}]]]}, {"class_name": "Dropout", "config": 