{"backend": "tensorflow", "config": {"name": "model_1", "layers": [{"name": "image_input", "config": {"dtype": "float32", "name": "image_input", "sparse": false, "batch_input_shape": [null, 256, 256, 3]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "vgg16", "config": {"name": "vgg16", "layers": [{"name": "input_1", "config": {"dtype": "float32", "name": "input_1", "sparse": false, "batch_input_shape": [null, 256, 256, 3]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "block1_conv1", "config": {"trainable": true, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "block1_conv1", "padding": "same", "kernel_size": [3, 3], "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 64}, "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "block1_conv2", "config": {"trainable": true, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "block1_conv2", "padding": "same", "kernel_size": [3, 3], "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 64}, "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"name": "block1_pool", "config": {"name": "block1_pool", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"name": "block2_conv1", "config": {"trainable": true, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "block2_conv1", "padding": "same", "kernel_size": [3, 3], "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 128}, "class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"name": "block2_conv2", "config": {"trainable": true, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "block2_conv2", "padding": "same", "kernel_size": [3, 3], "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 128}, "class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"name": "block2_pool", "config": {"name": "block2_pool", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"name": "block3_conv1", "config": {"trainable": true, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "block3_conv1", "padding": "same", "kernel_size": [3, 3], "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 256}, "class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"name": "block3_conv2", "config": {"trainable": true, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "block3_conv2", "padding": "same", "kernel_size": [3, 3], "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 256}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"name": "block3_conv3", "config": {"trainable": true, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "block3_conv3", "padding": "same", "kernel_size": [3, 3], "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 256}, "class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"name": "block3_pool", "config": {"name": "block3_pool", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"name": "block4_conv1", "config": {"trainable": true, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "block4_conv1", "padding": "same", "kernel_size": [3, 3], "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 512}, "class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"name": "block4_conv2", "config": {"trainable": true, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "block4_conv2", "padding": "same", "kernel_size": [3, 3], "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 512}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"name": "block4_conv3", "config": {"trainable": true, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "block4_conv3", "padding": "same", "kernel_size": [3, 3], "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 512}, "class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"name": "block4_pool", "config": {"name": "block4_pool", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"name": "block5_conv1", "config": {"trainable": true, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "block5_conv1", "padding": "same", "kernel_size": [3, 3], "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 512}, "class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"name": "block5_conv2", "config": {"trainable": true, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "block5_conv2", "padding": "same", "kernel_size": [3, 3], "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 512}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"name": "block5_conv3", "config": {"trainable": true, "strides": [1, 1], "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "block5_conv3", "padding": "same", "kernel_size": [3, 3], "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1, 1], "filters": 512}, "class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"name": "block5_pool", "config": {"name": "block5_pool", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "data_format": "channels_last"}, "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["block5_pool", 0, 0]]}, "class_name": "Model", "inbound_nodes": [[["image_input", 0, 0, {}]]]}, {"name": "words_input", "config": {"dtype": "float32", "name": "words_input", "sparse": false, "batch_input_shape": [null, 60]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "dropout_1", "config": {"name": "dropout_1", "trainable": true, "rate": 0.3, "seed": null, "noise_shape": null}, "class_name": "Dropout", "inbound_nodes": [[["vgg16", 1, 0, {}]]]}, {"name": "textModel", "config": {"name": "textModel", "layers": [{"name": "words_input", "config": {"dtype": "float32", "name": "words_input", "sparse": false, "batch_input_shape": [null, 60]}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "w2v_emb", "config": {"trainable": true, "dtype": "float32", "embeddings_initializer": {"config": {"minval": -0.05, "seed": null, "maxval": 0.05}, "class_name": "RandomUniform"}, "mask_zero": false, "embeddings_regularizer": null, "name": "w2v_emb", "embeddings_constraint": null, "batch_input_shape": [null, null], "input_length": null, "input_dim": 20795, "output_dim": 300, "activity_regularizer": null}, "class_name": "Embedding", "inbound_nodes": [[["words_input", 0, 0, {}]]]}, {"name": "conv1d_1", "config": {"trainable": true, "strides": [1], "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "conv1d_1", "padding": "same", "kernel_size": [3], "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1], "filters": 300}, "class_name": "Conv1D", "inbound_nodes": [[["w2v_emb", 0, 0, {}]]]}, {"name": "conv1d_2", "config": {"trainable": true, "strides": [1], "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "conv1d_2", "padding": "same", "kernel_size": [3], "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [2], "filters": 300}, "class_name": "Conv1D", "inbound_nodes": [[["w2v_emb", 0, 0, {}]]]}, {"name": "conv1d_3", "config": {"trainable": true, "strides": [1], "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "conv1d_3", "padding": "same", "kernel_size": [5], "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1], "filters": 300}, "class_name": "Conv1D", "inbound_nodes": [[["w2v_emb", 0, 0, {}]]]}, {"name": "conv1d_4", "config": {"trainable": true, "strides": [1], "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "conv1d_4", "padding": "same", "kernel_size": [5], "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [2], "filters": 300}, "class_name": "Conv1D", "inbound_nodes": [[["w2v_emb", 0, 0, {}]]]}, {"name": "conv1d_5", "config": {"trainable": true, "strides": [1], "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "conv1d_5", "padding": "same", "kernel_size": [7], "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1], "filters": 300}, "class_name": "Conv1D", "inbound_nodes": [[["w2v_emb", 0, 0, {}]]]}, {"name": "conv1d_6", "config": {"trainable": true, "strides": [1], "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "conv1d_6", "padding": "same", "kernel_size": [7], "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [2], "filters": 300}, "class_name": "Conv1D", "inbound_nodes": [[["w2v_emb", 0, 0, {}]]]}, {"name": "concatenate_1", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "class_name": "Concatenate", "inbound_nodes": [[["conv1d_1", 0, 0, {}], ["conv1d_2", 0, 0, {}], ["conv1d_3", 0, 0, {}], ["conv1d_4", 0, 0, {}], ["conv1d_5", 0, 0, {}], ["conv1d_6", 0, 0, {}]]]}, {"name": "conv1d_7", "config": {"trainable": true, "strides": [1], "activity_regularizer": null, "use_bias": true, "kernel_regularizer": null, "name": "conv1d_7", "padding": "same", "kernel_size": [1], "activation": "relu", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "dilation_rate": [1], "filters": 300}, "class_name": "Conv1D", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_1", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_7", 0, 0, {}]]]}, {"name": "sa10", "config": {"name": "sa10", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "sa11", "config": {"name": "sa11", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "sa12", "config": {"name": "sa12", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "sa13", "config": {"name": "sa13", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "sa14", "config": {"name": "sa14", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "sa15", "config": {"name": "sa15", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "sa16", "config": {"name": "sa16", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "sa17", "config": {"name": "sa17", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_2", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa10", 0, 0, {}]]]}, {"name": "batch_normalization_3", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_3", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa11", 0, 0, {}]]]}, {"name": "batch_normalization_4", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_4", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa12", 0, 0, {}]]]}, {"name": "batch_normalization_5", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_5", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa13", 0, 0, {}]]]}, {"name": "batch_normalization_6", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_6", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa14", 0, 0, {}]]]}, {"name": "batch_normalization_7", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_7", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa15", 0, 0, {}]]]}, {"name": "batch_normalization_8", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_8", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa16", 0, 0, {}]]]}, {"name": "batch_normalization_9", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_9", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa17", 0, 0, {}]]]}, {"name": "concat_selfattn_1", "config": {"name": "concat_selfattn_1", "trainable": true, "axis": -1}, "class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}], ["batch_normalization_3", 0, 0, {}], ["batch_normalization_4", 0, 0, {}], ["batch_normalization_5", 0, 0, {}], ["batch_normalization_6", 0, 0, {}], ["batch_normalization_7", 0, 0, {}], ["batch_normalization_8", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]]}, {"name": "condense_attention1d_1", "config": {"name": "condense_attention1d_1", "trainable": true}, "class_name": "CondenseAttention1D", "inbound_nodes": [[["concat_selfattn_1", 0, 0, {}]]]}, {"name": "residual_combine_selfattn_1", "config": {"name": "residual_combine_selfattn_1", "trainable": true}, "class_name": "ResidualCombine", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}], ["condense_attention1d_1", 0, 0, {}]]]}, {"name": "batch_normalization_10", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_10", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["residual_combine_selfattn_1", 0, 0, {}]]]}, {"name": "sa20", "config": {"name": "sa20", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "sa21", "config": {"name": "sa21", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "sa22", "config": {"name": "sa22", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "sa23", "config": {"name": "sa23", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "sa24", "config": {"name": "sa24", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "sa25", "config": {"name": "sa25", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "sa26", "config": {"name": "sa26", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "sa27", "config": {"name": "sa27", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "batch_normalization_11", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_11", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa20", 0, 0, {}]]]}, {"name": "batch_normalization_12", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_12", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa21", 0, 0, {}]]]}, {"name": "batch_normalization_13", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_13", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa22", 0, 0, {}]]]}, {"name": "batch_normalization_14", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_14", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa23", 0, 0, {}]]]}, {"name": "batch_normalization_15", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_15", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa24", 0, 0, {}]]]}, {"name": "batch_normalization_16", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_16", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa25", 0, 0, {}]]]}, {"name": "batch_normalization_17", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_17", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa26", 0, 0, {}]]]}, {"name": "batch_normalization_18", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_18", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa27", 0, 0, {}]]]}, {"name": "concat_selfattn_2", "config": {"name": "concat_selfattn_2", "trainable": true, "axis": -1}, "class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}], ["batch_normalization_12", 0, 0, {}], ["batch_normalization_13", 0, 0, {}], ["batch_normalization_14", 0, 0, {}], ["batch_normalization_15", 0, 0, {}], ["batch_normalization_16", 0, 0, {}], ["batch_normalization_17", 0, 0, {}], ["batch_normalization_18", 0, 0, {}]]]}, {"name": "condense_attention1d_2", "config": {"name": "condense_attention1d_2", "trainable": true}, "class_name": "CondenseAttention1D", "inbound_nodes": [[["concat_selfattn_2", 0, 0, {}]]]}, {"name": "residual_combine_selfattn_2", "config": {"name": "residual_combine_selfattn_2", "trainable": true}, "class_name": "ResidualCombine", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}], ["condense_attention1d_2", 0, 0, {}]]]}, {"name": "batch_normalization_19", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_19", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["residual_combine_selfattn_2", 0, 0, {}]]]}, {"name": "sa30", "config": {"name": "sa30", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"name": "sa31", "config": {"name": "sa31", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"name": "sa32", "config": {"name": "sa32", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"name": "sa33", "config": {"name": "sa33", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"name": "sa34", "config": {"name": "sa34", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"name": "sa35", "config": {"name": "sa35", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"name": "sa36", "config": {"name": "sa36", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"name": "sa37", "config": {"name": "sa37", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}]]]}, {"name": "batch_normalization_20", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_20", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa30", 0, 0, {}]]]}, {"name": "batch_normalization_21", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_21", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa31", 0, 0, {}]]]}, {"name": "batch_normalization_22", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_22", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa32", 0, 0, {}]]]}, {"name": "batch_normalization_23", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_23", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa33", 0, 0, {}]]]}, {"name": "batch_normalization_24", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_24", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa34", 0, 0, {}]]]}, {"name": "batch_normalization_25", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_25", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa35", 0, 0, {}]]]}, {"name": "batch_normalization_26", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_26", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa36", 0, 0, {}]]]}, {"name": "batch_normalization_27", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_27", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa37", 0, 0, {}]]]}, {"name": "concat_selfattn_3", "config": {"name": "concat_selfattn_3", "trainable": true, "axis": -1}, "class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_20", 0, 0, {}], ["batch_normalization_21", 0, 0, {}], ["batch_normalization_22", 0, 0, {}], ["batch_normalization_23", 0, 0, {}], ["batch_normalization_24", 0, 0, {}], ["batch_normalization_25", 0, 0, {}], ["batch_normalization_26", 0, 0, {}], ["batch_normalization_27", 0, 0, {}]]]}, {"name": "condense_attention1d_3", "config": {"name": "condense_attention1d_3", "trainable": true}, "class_name": "CondenseAttention1D", "inbound_nodes": [[["concat_selfattn_3", 0, 0, {}]]]}, {"name": "residual_combine_selfattn_3", "config": {"name": "residual_combine_selfattn_3", "trainable": true}, "class_name": "ResidualCombine", "inbound_nodes": [[["batch_normalization_19", 0, 0, {}], ["condense_attention1d_3", 0, 0, {}]]]}, {"name": "batch_normalization_28", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_28", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["residual_combine_selfattn_3", 0, 0, {}]]]}, {"name": "sa40", "config": {"name": "sa40", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"name": "sa41", "config": {"name": "sa41", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"name": "sa42", "config": {"name": "sa42", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"name": "sa43", "config": {"name": "sa43", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"name": "sa44", "config": {"name": "sa44", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"name": "sa45", "config": {"name": "sa45", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"name": "sa46", "config": {"name": "sa46", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"name": "sa47", "config": {"name": "sa47", "trainable": true}, "class_name": "SelfAttention", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}]]]}, {"name": "batch_normalization_29", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_29", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa40", 0, 0, {}]]]}, {"name": "batch_normalization_30", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_30", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa41", 0, 0, {}]]]}, {"name": "batch_normalization_31", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_31", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa42", 0, 0, {}]]]}, {"name": "batch_normalization_32", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_32", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa43", 0, 0, {}]]]}, {"name": "batch_normalization_33", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_33", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa44", 0, 0, {}]]]}, {"name": "batch_normalization_34", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_34", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa45", 0, 0, {}]]]}, {"name": "batch_normalization_35", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_35", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa46", 0, 0, {}]]]}, {"name": "batch_normalization_36", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_36", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["sa47", 0, 0, {}]]]}, {"name": "concat_selfattn_4", "config": {"name": "concat_selfattn_4", "trainable": true, "axis": -1}, "class_name": "Concatenate", "inbound_nodes": [[["batch_normalization_29", 0, 0, {}], ["batch_normalization_30", 0, 0, {}], ["batch_normalization_31", 0, 0, {}], ["batch_normalization_32", 0, 0, {}], ["batch_normalization_33", 0, 0, {}], ["batch_normalization_34", 0, 0, {}], ["batch_normalization_35", 0, 0, {}], ["batch_normalization_36", 0, 0, {}]]]}, {"name": "condense_attention1d_4", "config": {"name": "condense_attention1d_4", "trainable": true}, "class_name": "CondenseAttention1D", "inbound_nodes": [[["concat_selfattn_4", 0, 0, {}]]]}, {"name": "residual_combine_selfattn_4", "config": {"name": "residual_combine_selfattn_4", "trainable": true}, "class_name": "ResidualCombine", "inbound_nodes": [[["batch_normalization_28", 0, 0, {}], ["condense_attention1d_4", 0, 0, {}]]]}, {"name": "batch_normalization_37", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_37", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["residual_combine_selfattn_4", 0, 0, {}]]]}, {"name": "gap", "config": {"name": "gap", "trainable": true}, "class_name": "GlobalAveragePooling1D", "inbound_nodes": [[["batch_normalization_37", 0, 0, {}]]]}, {"name": "a10", "config": {"name": "a10", "trainable": true}, "class_name": "Attention", "inbound_nodes": [[["gap", 0, 0, {}], ["batch_normalization_37", 0, 0, {}]]]}, {"name": "a11", "config": {"name": "a11", "trainable": true}, "class_name": "Attention", "inbound_nodes": [[["gap", 0, 0, {}], ["batch_normalization_37", 0, 0, {}]]]}, {"name": "a12", "config": {"name": "a12", "trainable": true}, "class_name": "Attention", "inbound_nodes": [[["gap", 0, 0, {}], ["batch_normalization_37", 0, 0, {}]]]}, {"name": "a13", "config": {"name": "a13", "trainable": true}, "class_name": "Attention", "inbound_nodes": [[["gap", 0, 0, {}], ["batch_normalization_37", 0, 0, {}]]]}, {"name": "a14", "config": {"name": "a14", "trainable": true}, "class_name": "Attention", "inbound_nodes": [[["gap", 0, 0, {}], ["batch_normalization_37", 0, 0, {}]]]}, {"name": "a15", "config": {"name": "a15", "trainable": true}, "class_name": "Attention", "inbound_nodes": [[["gap", 0, 0, {}], ["batch_normalization_37", 0, 0, {}]]]}, {"name": "a16", "config": {"name": "a16", "trainable": true}, "class_name": "Attention", "inbound_nodes": [[["gap", 0, 0, {}], ["batch_normalization_37", 0, 0, {}]]]}, {"name": "a17", "config": {"name": "a17", "trainable": true}, "class_name": "Attention", "inbound_nodes": [[["gap", 0, 0, {}], ["batch_normalization_37", 0, 0, {}]]]}, {"name": "batch_normalization_38", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "center": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_regularizer": null, "name": "batch_normalization_38", "beta_constraint": null, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["a10", 0, 0, {}]]]}, {"name": "batch_normalization_39", "config": {"trainable": true, "momentum": 0.99, "gamma_initializer": {"config": {}, 